[
  [
    "Equip Foods Prime Protein Powder | Clean, Grass Fed Beef Protein Isolate | Carnivore Protein Powder | Paleo, Keto Friendly | Gluten, Dairy Free | Helps Build & Repair Tissue | 30 Servings, Chocolate",
    "Equip Foods Core Colostrum - Unflavored Equip Foods Core Colostrum Gummies - Raspberry Equip Foods Core Colostrum Gummies - Peach Mango Equip Foods Prime Protein Powder | Clean, Grass Fed Beef Protein Isolate | Ca... Equip Foods Prime Protein Powder | Clean, Grass Fed Beef Protein Isolate | Ca... Equip Foods Grass-Fed Collagen - Unflavored Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.6 out of 5 stars 447 4.6 out of 5 stars 447 4.6 out of 5 stars 447 4.3 out of 5 stars 2,854 4.3 out of 5 stars 2,854 4.6 out of 5 stars 377 Price $47.99$47.99 $39.99$39.99 $39.99$39.99 $67.99$67.99 $67.99$67.99 $49.99$49.99 Item Form Powder Gummy Gummy Powder Powder Powder Servings 30 30 30 30 30 30 Calories Per Serving 10 38 38 90 90 60 Goals & Benefits Improve vitality, Boost gut health and immunity, Revitalize skin radiance Boost gut health and immunity, revitalize hair and skin Boost gut health and immunity, revitalize hair and skin Build and repair tissues, Boost muscle recovery, Increase strength, Stay lean Build and repair tissues, Boost muscle recovery, Increase strength, Stay lean Improve the health of the joints, gut lining, connective tissues, and skin Amount Per Serving 3,000mg colostrum powder, 2g protein 1g Colostrum 1g Colostrum 21g Protein, 1mcg Vitamin B12, 360mg Chloride, 380mg Sodium, 0.5mg Iron 21g Protein, 1mcg Vitamin B12, 120mg Chloride, 220mg Sodium, 0.82mg Iron 15g Hydrolyzed Bovine Collagen: 14g Protein, 750mcg Iron, 45mg Sodium Made Without: gluten, dairy, soy, hormone, whey, antibiotic, preservative, artificial flavors ✓ ✓ ✓ ✓ ✓ ✓",
    67.99,
    "Health & Household",
    "https://m.media-amazon.com/images/I/71ED7Aru1aL._AC_SL1500_.jpg"
  ],
  [
    "CRAFTSMAN 25-Ft Tape Measure with Fraction Marketing, Retractable, Manual-Locking Blade (CMHT37443S)",
    "The CRAFTSMAN Compact Easy Grip 25 ft. Tape Measure is loaded with big features. An outstanding 13 ft. of max reach* means you can work unassisted. And its compact size, comfortable grip, and easy-read fractions help you cut a long day's work down to size.",
    13.98,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71kKEeNZe+L._AC_SL1500_.jpg"
  ],
  [
    "Lodge ASHH11MPK Handle Holder, 0, Black",
    "Preparing new and exciting recipes is always better with great cooking accessories, and Lodge has an extensive line of indoor and outdoor items. From brightly colored Silicone Handle Holders to Max Temp Oven Mitts, Lodge has many of your accessory needs covered. These silicone handle holders are heat-resistant and a great addition to any kitchen. Just slide the holder onto the hot handle and remove pots and pans with ease. The special silicone offers protection up to 450-degrees. Creates a safe and comfortable grip of hot cookware handles. Flexible enough to store compactly in a drawer. Available in a rainbow of different colors and is dishwasher-safe. Fits Lodge Keyhole handle skillets 9-inch diameter and up. Also check out the Lodge ASHHM11 or ASHHM41 for smaller handle version to fit Lodge Keyhole skillets 8-inch diameter and smaller. Fits most traditional Lodge style handles.",
    9.48,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/51RauYooviL._AC_SL1210_.jpg"
  ],
  [
    "Genie GLEDB2-R2 2 Pack Garage Door Opener LED LIGHT BULB, 4000K,White",
    "Traditional LED light bulbs can cause more problems in your garage door opener than they solve. They can be more delicate and subject to breakage in the rougher environment of the garage, and some LED light bulbs emit noise that can actually interfere with radio frequencies, affecting the responsiveness or range of your opener’s remotes. That’s where the Genie LED garage door opener bulb comes in. This bulb is specifically designed for garage door openers and creates little or no radio frequency to interfere with openers. The range of your remotes will not be limited with the long lasting Genie bulb. The garage door opener bulb is also made to withstand the harsher environment of the garage. These bulbs are cold weather tested and damp location rated to function without the many inconveniences associated with traditional bulbs used for this application. Other bulbs can be rendered ineffective in unheated and/or damp garages, but Genie’s LED bulb illuminates your damp garage down to temperatures of –30C (–22F), with a 4000K rating. These conditions will not impact the light’s performance. Garage door openers vibrate during operation, and this has the potential to shorten the life of normal light bulbs used in the opener. Genie’s LED bulb is made of shatter & vibration-resistant materials and is tested to withstand 5G of shaking force, which far exceeds normal garage door opener vibration force. Genie's quality LED bulbs offer bright, long lasting and efficient lighting for your garage. These bulbs will operate for an estimated 25, 000 hours, costing approximately 1. 07/year, depending on local utilities. Get energy savings and a bulb that will last without sacrificing brightness",
    19.83,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/51dn5dSqtBL._AC_SL1200_.jpg"
  ],
  [
    "Pawfly Mini Aquarium Air Pump for 3-20 Gallon Nano Fish Tanks 15 GPH Oxygen Aerator Pump with Bracket Airline Tubing Air Stone Control Valve and Check Valve Accessories",
    "MA60 U33 U32 U31 UL40 Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.5 out of 5 stars 6,623 4.2 out of 5 stars 654 4.4 out of 5 stars 450 4.4 out of 5 stars 450 4.5 out of 5 stars 12,870 Price $8.99$8.99 $14.99$14.99 $9.99$9.99 $9.99$9.99 $14.99$14.99 Aquarium Size 5 - 20 Gallons 3-20 gallons 3-20 gallons 3-20 gallons 10-60 Gallons Max Output 40 GPH 15 GPH 15 GPH 15 GPH 64 GPH Sound < 45 dB < 35 dB < 35 dB < 35 dB 25-40 dB Outlet 1 1 1 1 2 Power 2 W 1 W 1 W 1 W 4 W Pressure 0.012 MPa 0.01 MPa 0.01 MPa 0.01 MPa 0.016 MPa Body Dimension 3.3\" x 1.8\" x 1.6\" 3.1\" x 2\" x 1.5\" 3.1\" x 2\" x 1.5\" 3.1\" x 2\" x 1.5\" 5.1\" x 2.8\" x 2.5\" Features Compact & lightweight With mini sponge filter With hanging bracket Mini USB air pump Complete accessories kit",
    9.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71xvqkauCkL._AC_SL1500_.jpg"
  ],
  [
    "Stylus (5 Pcs), 2-in-1 Stylus Pen for Touch Screen, High Precision and Sensitivity, Suitable for iPhone/ipad/Android Tablets, Compatible with All Touch Screens (Black/White/Blue/Rose Gold/Silver)",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Extensive Compatibility, Works Just As Well As a Real Pencil！ Previous page Next page 2 Different Precision Pen Tips,2 Different Writing Experiences   Previous page Next page 1 Drawing 2 Note-Taking 3 Commercial Affairs 4 Play Games 5 Editing Video BOPOMOFO Other Product Portfolio 5PCS 2 in 1 Stylus Pens Add to Cart 2PCS Stylus Pens Add to Cart 3PCS Stylus Pens Add to Cart 5PCS Stylus Pens Add to Cart 5PCS 2 in 1 Stylus Pens Add to Cart Customer Reviews 4.5 out of 5 stars 1,557 4.5 out of 5 stars 3,552 4.5 out of 5 stars 3,552 4.5 out of 5 stars 3,552 4.5 out of 5 stars 1,557 Price $9.99$9.99 $6.99$6.99 $7.99$7.99 $9.99$9.99 $11.99$11.99 Compatible Range All Touch Screens All Touch Screens All Touch Screens All Touch Screens All Touch Screens Color Silver/Blue/Gold/White/Black Purple/Pink Blue/Purple/Pink Pink/Yellow/Green/Blue/Purple Pink/Yellow/Green/Blue/Purple Material Aluminum Aluminum Aluminum Aluminum Aluminum Battery Required? No No No No No Bluetooth Requires? No No No No No",
    9.99,
    "Cell Phones & Accessories",
    "https://m.media-amazon.com/images/I/61WFOxtjgIL._AC_SL1500_.jpg"
  ],
  [
    "Natural Sisal White Rope for Cat Scratcher Scratching Post Replacement 1/4 inch Cat Tree Rope for Repairing, Recovering or DIY Cat Scratcher 50/100/164 Feet",
    "Treasborn focuses on the pet industry and offers you quality products     Durable and Neat! This pure white sisal rope made of high quality sisal fiber materials. The threads are tightly twisted together, so they are durable and no chipping.   A sad before and a happy after of your cat tree! Have you ever been bothered by the fact that the structure of the cat tree is fine but the rope has been worn out? Using this sisal rope with an industrial stapler to replace the worn rope,you will make the old look new.   Would you like to own a one-of-a-kind twine ornament? Let's be creative and give your home life a different ornament, pure white ropes go well with any furniture style! 50Feet 100Feet 164Feet 2.75Wx11.8L Replacement posts 3.35Wx15.74L Replacement posts Add to Cart Add to Cart Add to Cart Buying Options Buying Options Customer Reviews 4.5 out of 5 stars 427 4.5 out of 5 stars 427 4.5 out of 5 stars 427 4.3 out of 5 stars 87 4.3 out of 5 stars 87 Price $8.99$8.99 $15.99$15.99 $20.99$20.99 — — Material Sisal Sisal Sisal Jute Jute",
    9.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/618oCuic82L._AC_SL1500_.jpg"
  ],
  [
    "NOW Foods Supplements, Valerian Root (Valeriana officinalis) 500 mg, Herbal Supplement, 250 Veg Capsules",
    "Valerian Root has been an herbal favorite in many cultures for centuries. Natural color variation may occur in this product.",
    21.99,
    "Health & Household",
    "https://m.media-amazon.com/images/I/61Gpgkxu27L._AC_SL1500_.jpg"
  ],
  [
    "12-Pack A19 LED Light Bulbs, 100W Equivalent Bulbs, 13W 5000K Daylight White LED Bulbs with Standard E26 Medium Base, Super Bright 1500 Lumens, CRI85+, No Flicker Non-Dimmable Bulbs for Lamp",
    "13W A19 5000K LED Light Bulbs The 100W LED bulb can be applied to many types of E26 socket lighting fixtures, bringing bright lightness to the corner of your home. More importantly, super bright LED light bulb provides 1500LM of brightness with only 13W energy consumption, equivalent to 100W of incandescent bulb.   Our daylight bulb emits uniform light without flickering or noise, protecting your eyes from harsh and glare lights, creating a cozy and comfortable atmosphere for you and your families.   Energy Saving 13W LED bulb is equivalent to 100W incandescent bulb, with a long lifespan of more than 25000 hours, dramatically reduce the frequency of your bulb replacements.   Super CRI85+ This daylight bulbs have a high CRI85+ that makes your surroundings clear, bright and closer to true and original colors.   Shatterproof Our A19 bulbs are safer and more durable than traditional glass bulbs, won't be broken when dropped, safe to use.   Safe to Touch The 1500 lumen LED bulbs generate less heat output than incandescent bulbs, without worrying about burning your hands, even after long hours of work.   Energy Saving   Super CRI85+   Shatterproof   Safe to Touch       Pendant Light Table Lamp Wall lamp   Super Multiple Applications The E26 led bulbs are easy to screw in various kind of lighting fixtures, such as table lamps, ceiling lights, pendant lights, chandeliers, wall sconces, floor lamp. It is greatly suitable for a variety of places in your bedroom, living room, dining room, kitchen, office, stairs. 27.5'' Set of 2 Farmhouse Table Lamps 73\" Gold Arc Floor Lamp 4-Light Farmhouse Ceiling Light Fixture Adjustable Industrial Floor Lamps 2-Pack Motion Sensor Outdoor Wall Lights Crystal Touch Table Lamp Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.5 out of 5 stars 193 4.3 out of 5 stars 136 4.5 out of 5 stars 178 4.2 out of 5 stars 243 4.6 out of 5 stars 23 4.0 out of 5 stars 245 Price $89.99$89.99 $119.99$119.99 $49.99$49.99 $89.99$89.99 $79.99$79.99 $24.99$24.99 Color Beige Gold Black Black Black Gold Features 2 USB Ports + Farmhouse Decoration Adjustable + Unique Decoration Unique Decoration + Working Adjustable + Industrial Decoration Motion Sensor + Dusk to Dawn Touch Control & Dimmable & Rechargeable Battery Material Fabric + Resin Metal + Marble Metal Metal Metal + Glass Metal & Plastic Color Temperature For All Color Temperatures For All Color Temperatures For All Color Temperatures For All Color Temperatures For All Color Temperatures 2700K-4000K-6000K Bulb Socket E26 E26 E12 E26 E26 LED",
    24.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71+aPZuqKXL._AC_SL1500_.jpg"
  ],
  [
    "Small Pet Select Unbleached White Paper Bedding, 56 L, Model Number: SMWB",
    "Just as soft and absorbent as our brown paper Bedding, This makes it easier to spot \"used\" Litter and clean up only messy areas. Small Pet Select premium paper based bedding is soft and absorbent. Made with unbleached paper fiber. Sludge free, and never recycled print. Our paper is not from the potentially dangerous leftovers from reclaimed paper production ( called \"sludge\", which has detectable levels of dioxin in it). Our paper is not from recycled paper that has been printed on either (which can also have toxic residues). our bedding is 99% dust free and is safe and comfortable for small pets. No dyes, no irritants! 56L (16L-compressed) - Large size - This is 6. 5lbs of premium quality paper based bedding. 1000 cu In - expands to 56L.",
    22.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71Dy61SVsfL._AC_SL1500_.jpg"
  ],
  [
    "The Honey Pot Company - Feminine Wipes - Daily PH Balancing, Fragrance & Sulfate Free Wipes for Intimate Parts, Body, or Face - Feminine Products - Sensitive 30 ct.",
    "The Honey Pot Company - Sensitive Wipes The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Wipes: clinically shown to minimize odor, cleanse and refresh The Honey Pot Company Sensitive Bundle Add to Cart Herbal Pads Add to Cart Non-Herbal Pads Add to Cart Tampons Add to Cart Menstrual Cup Buying Options Body Cleanser Add to Cart Customer Reviews 4.7 out of 5 stars 360 4.6 out of 5 stars 10,018 4.6 out of 5 stars 756 4.5 out of 5 stars 386 4.3 out of 5 stars 459 4.9 out of 5 stars 22 Herbal ✔ ✔ ✘ ✘ ✘ ✔ Non-Herbal ✘ ✘ ✔ ✔ ✔ ✘ Organic Cotton ✘ ✔ ✔ ✔ ✘ ✘ pH Balancing ✔ ✔ ✔ ✔ ✔ ✔ Great for Travel ✔ ✔ ✔ ✔ ✔ ✔ Meet a More Sensitive Solution   This sensitive cleansing wipe formula is plant-derived and made with herbal ingredients. This products for you if you’re easily irritated whenever you introduce new products into your routine. Gynecologist-approved and clinically shown to minimize odor, cleanse and refresh.   How do I use the wipes? Remove one wipe and wipe from front to back, simple as that. These wipes can also be used as period wipes so you can stay fresh no matter the circumstance. Combine with our wash and spray for all-day fresh! Can I use the wipes on other parts of my body? Yes! The wipes can be used on intimate parts, the body, and the face! Can I flush my wipes? We do not recommend flushing wipes or any feminine care products as they do not dissolve and can cause a sewage blockage that can lead to flooding or structural damage. We ask that you dispose of any wipes and feminine care in your garbage bin.",
    10.99,
    "Health & Household",
    "https://m.media-amazon.com/images/I/61-OuGlujRL._SL1500_.jpg"
  ],
  [
    "FUZZU Donald Trump Political Parody Novelty Durable Dog Chew Toy with Squeaker, Small 12\"",
    "Mr. Donald (2020 Special Edition) Mr. Joe Humptee Trumptee Ms. Hillary Mr. Bernie Buying Options Buying Options Add to Cart Buying Options Add to Cart Customer Reviews 4.6 out of 5 stars 1,223 4.6 out of 5 stars 691 4.4 out of 5 stars 201 4.6 out of 5 stars 481 4.4 out of 5 stars 164 Price — — $13.13$13.13 — $14.69$14.69 Size Small to Large Dog (Various Sizes Available) Small to Large Dog (Various Sizes Available) Small to Large Dog (12”) Medium to Large Dog (17”) Medium to Large Dog (17”) Squeaker ✓ ✓ Big Bold Squeaker! ✓ ✓ Non-Toxic Durable Canvas ✓ ✓ ✓ ✓ ✓ Fortified Seams with Triple Stitching ✓ ✓ ✓ ✓ ✓ Floppy Limbs for Shaking and Staging ✓ ✓ ✓ ✓ ✓ Plush Accent Yes Yes Yes No Yes Crackly Crunch in Arms and Legs No No Yes No No Available as a Cat Toy Yes Yes Yes Yes Yes",
    14.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/91TiYUW963L._AC_SL1500_.jpg"
  ],
  [
    "TRIXIE Fun Board Strategy Game for Cats, Puzzle Toy, Treat Dispenser, Interactive Play, Mental Stimulation",
    "Stimulate Your Cat's Mind and Body with TRIXIE Interactive ToysKeep your feline friend entertained and engaged with TRIXIE’s selection of interactive cat toys and food puzzle toys. Our enriching toys are designed to challenge your cat's instincts, promote mental and physical stimulation, and provide hours of fun. From puzzle feeders to interactive toys, our collection offers a variety of options to suit every cat's personality and play style. Discover the perfect toy to spark your cat's curiosity and keep them active and happy.Unleash your cat's inner hunter with the TRIXIE Fun Board; this interactive puzzle toy stimulates your cat's senses, encourages problem-solving skills, and provides a healthy outlet for their instincts. Filling the compartments with treats or food will create a rewarding experience that will keep your cat engaged and happy. Whether you have a playful kitten or a senior cat, the TRIXIE Fun Board offers a fun and enriching way to enhance your cat's quality of life.",
    18.74,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/61Eb9eSHEvL._AC_SL1500_.jpg"
  ],
  [
    "130W USB C Laptop Charger for Dell XPS 15 17 9575 9500 9510 9520 9530 9700 9710 9720 9730,Precision 5470 5480 5550 5560 5530 5570 5750 5760 5770 3550 3560 3570 3571 2in1,Latitude,AC Adapter Power Cord",
    "About this item 🔋【Dell 130w Laptop Charger USB C】 Input Voltage: 100 ~ 240V Input Frequency:50 ~ 60Hz,Output Voltage: 20V/5V-6.5A/1A.Connector Size：USB-C/Type C port,Watt:130 Watt( Compatible with Dell 90W USB C Charger，Dell 65W USB C Charger). 🔋【Compatible Dell Computer Model】Compatible with Dell Precision 5530 2in1,Precision 3470 3541 3551 3560 3561 3570 3571 5470 5550 5560 5570 5750 5760 5770, XPS 15 9575 2-in-1 9500,XPS 17 9700 9710,Latitude 5430 7430 9430 5330 5530 7330 7530 9330 Rugged Extreme Charger,Latitude 9510 9410 7410 7310 7210 5520 5511 5510 5420 5411 5410 5400 5320 5310 3500 3400 and more 130w dell laptop models with USB C charging port. 🔋【Compatible Dell 130W AC Adapter】Replacement Dell XPS 15 9575 2-in-1 4K Touch-Screen Laptop Model: XPS9575-7354BLK-PUS. 🔋【Compatible with Dell P/N】T4V18 0K00F5 K00F5 0M0H25 M0H25 450-AHOM DA130PM170 HA130PM170 0TDK33 0Y2XGV. 🔋【Safety and Warranty】 Dell 130w laptop charger is CE/FCC/ROHS safety certified and designed.If you have any questions about the charger, please contact us. We provide 30 days unsatisfactory refund for the dell 130w laptop charger and 12 months warranty service. › See more product details",
    31.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/61IVifMebYL._AC_SL1500_.jpg"
  ],
  [
    "WANNTS Pumpkin Carving Kit Halloween, Safe and Easy Set for Kids, DIY Stainless Steel Tools Halloween Decoration Jack-O-Lanterns, Gift Halloween(24 Pieces)",
    "Carving pumpkins with your family and friends is a tradition that will leave everyone with lifelong memories of those moments. Those moments shouldn’t be spoiled by faulty pumpkin carving tools. That's why we specially designed this stainless steel 24 PCS pumpkin carving kit that includes everything you need for your Jack-o-Lantern masterpiece! Safer and Easier for Kids :The pumpkin carving kit is safer and easier for your kids so that it won't hurt your skin even you touch it. Nice Halloween pumpkin carving set is suitable for people of all ages, absolutely safe for kids! Over 1000 Pumpkin Patterns You Can Create: Use your imagination to create over 1000 pumpkin emotes. High-quality Stainless Steel& Washable: Our pumpkin carving kits are 100% dishwasher safe. Also use as a pumpkin cleaning tool or as the pumpkin gutter. EASY TO USE for Children : These professional carving tools work as a pumpkin decorating kit push in. A child pumpkin carving kit has never been so easy and safe. Great Halloween Gift: Halloween won’t be completed without carving pumpkins and jack-o'-lanterns! Creating a jack-o-lantern is a fun job, our pumpkin carving kit has 24pcs, can allow you to cooperate with your families and friends at the same time, enjoy the happy Halloween pumpkin carving time.Any questionn, please contact our service team without hesitation, we will try our best to provide you a satisfaction response.",
    29.98,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/814dtd0eA+L._AC_SL1500_.jpg"
  ],
  [
    "Vintage LED Edison Bulbs 6W, Equivalent 60W Incandescent, Warm White 2700K, ST58 Antique LED Filament Bulbs with 90+ CRI, E26 Medium Base,Dimmable, Clear Glass, Pack of 6",
    "High Brightness Vintage Style LED Edison Bulbs, Dimmable Clear Glass Antique ST58 LED Filament Light Bulbs Combine the vintage glass filament lighting look and feel with the advantages of modern LED technology with this stylish 6-pack of decorative light led bulbs from Gozelux. Energy efficient LEDs replace a 60-watt incandescent, producing a 2700K Warm White glow that gives the home a cozy feel. A stylish ST19 shape with vertical filament strips wrapped in clear glass housing is ideal for decorative lighting fixtures and will enhance the décor of any room. Enhance 90+ CRI makes skin tones more natural and colors vibrant, all while saving energy and lasting 25,000 hours or more. Choose a dependable led edison bulb for your residential or commercial decorative lighting applications.       Enhance True Colors CRI (color rendering index) is a simple and helpful lighting spec to predict how good the visual output of a lighting product will be. Simply put, the metric is a number between 0 and 100 that is used to predict how well a product renders colors. The closer to 100, the better- or more true - colors should look under its light. Eay to Install All you need to do is take bulbs out of the well-packed package and then screw them into the sockets of any E26 medium base light fixtures. Great ideal for lanterns, ceiling fixtures, chandeliers Wall Sconces, Modern Fashion fixtures, Pendent fixtures, Decorative Clear Shade, and pendants. Edison-style filaments create a warm and comfortable atmosphere in your bedroom, dining rooms, kitchens, porches, and more. High-end Designed Dimming Solutions Dimmable E26 LED edison bulbs are designed with the latest light source technology, which makes them compatible with most dimmers in the market, providing a smooth dimming control with the highest brightness at 100% and the lowest brightness at 0% without flicker or buzzing. The smooth dimming pattern allows you to adjust the perfect brightness for your room anytime.   High Brightness Dimmable ST58 LED Edison Bulbs Instant on at full brightness of 750 lumens, the 60w equivalent LED edison bulbs are bright enough for anywhere that need to illuminate, leaving no dark space. 2700K warm white edison light bulb creates a warm, cozy atmosphere. It is a great illumination for living room, bedroom, kitchen and commercial areas, ect. Recommended Dimmer Lists: Lutron Skylark: SCL-153P,CTCL-153PDH-WH,CTCT-153P,S-600P-GR,S-600PNL-LA,SFSQ-F-LA,S-600P-WH,S-603P-WH; Lutron Toggler: TGCL-153PH-WH,AYCL-153P,AYCL-253P-WH; Lutron Davi: DVELV-300P-WH,DVWCL-153PH-WH,DVELV-303P-WH,DVCL-153P,MACL-153M,DVSCCL-153P,DV-603PG-WH,DV-600P-WH,DVSCCL-253P-WH; Lutron Maestro: MACL-153M-WH,MAELV-600-WH,MSCL-OP153M,MSCL-VP153M,MRF2-6CL; Lutron Caseta: PD-6WCL-WH; LEVITON: VPE06-1LZ ,IPI06-1LZ,6631-1LT,6672-1LW,6633-PLW,6674-P0W,6602-220; Eaton: SAL06P Lighting Facts CCT: 2700K Warm White Voltage: AC 110-130V Brightness: 750 Lumen Wattage: 6 Watt Equivalent 60Watt Base: E26 Medium Dimmable: Smooth 0%-100% CRI> 90 Beam angle: 360° degrees   Application for E26 LED Edison Bulb: Extensively applied in lighting fixtures indoor and outdoor lighting, such as pendant, ceiling, island, chandeliers, sputnik, vanity, globes, ceiling fan, bathroom, wall sconces, patio, lightstand, floor lamp, pipe light, water pipe light fixture, desk lamp, squirrel case; hallway, pathway, post, porch, yard, garden for outdoor.",
    25.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71jZTQwvesL._AC_SL1500_.jpg"
  ],
  [
    "Dog Shock Collar 4265Ft Dog Training Collar with Remote for Large Medium Small Dogs, IP67 Waterproof with 4 Safe Training Modes, Security Lock, Dog Bark E-Collar for All Breeds(Green 1 Pack)",
    "Safe Light Modes   Package Including 1* Remote Transmitter 1* Receiver Collar 1* Dual Type-C Charging Cable 1* Test Light 4* Metal Prongs 4* Silicone Prongs 1* Lanyard 1* User Operating Guide Multiple Lighting Modes When we take our dog for a walk at night, our dog may run away alone. In this case, you can choose to turn on our safe light mode. There are two modes: Steady light & Flash light. You can choose different lighting modes according to the habits of each dog. Green Light: The green light would be flash for one second, when turn on the collar or transmit instruction. White Light: Press the light button to turn on the steady white light. Flash Light: Press and hold the light button for three seconds to turn on the flash. The flash includes three colors: red, white and blue.       LCD Screen This dog shock collar uses LCD screen, large character design, even in the strong sunlight outdoors, you can see the screen clearly. Simple Operation Adjusting and switching with one button. Press to switch the beep, vibration, and shock mode. Rotate to adjust the intensity, beep(1-8), vibration(1-16), and shock(0-99). IP67 Waterproof Collar Our dog training collar with remote is IP67 waterproof, the collar can be used in the water. Doggie could use this when swimming, bathing, raining etc.. The remote is not waterproof.         Security Lock Safe lock can effectively avoid false triggering in hand or in pocket. Avoid dogs receiving false commands. Protect Dog's Skin Silicone protective cover to avoid direct contact between the dog's skin and the shock metal to prevent accidental injury. Safe Shock Mode Even though our shock mode is perfectly safe, but use as little as possible when it is not necessary. Rechargeable Dog Shock Collar E- bark collar with long standby rechargeable battery. You can charge the remote and collar with multiple way.",
    39.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71AgZE2bZNL._AC_SL1500_.jpg"
  ],
  [
    "Benebone Fishbone Durable Dog Chew Toy for Aggressive Chewers, Real Fish, Made in USA, Medium",
    "The Benebone Fishbone Dogs love to chew, especially on stuff that's got a hint of real fish flavor. The curved fish shape is paw-friendly, but challenging at the same time. About Benebone At Benebone, we started with the premise that dogs experience scent and flavor in a way we can't even grasp. So we ditched the neon colors and loud squeaks. Inspired by a dog's powerful sense of smell, we developed a long-lasting durable chew that's jam-packed with real fish flavor. Once your dog takes a bite of our USA-made chews, he'll be hooked. We're Obsessed with Safety Too Wonder if Benebone is right for your dog? Here's what you need to know. Since it's hard, it's important that your pup has strong teeth. If you're unsure, check with your vet. Nobody likes an unexpected trip to the dentist. Keep an eye out for wear and tear. Within a month or so, we find that most dogs chew Benebone into submission. See the wear page on our website for helpful photos to determine when to replace yours. Keep away from households with peanut or other allergies. What's Inside? Nothing but Nylon and Real Fish for Tantalizing Flavor.",
    13.45,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/7139XZutCML._AC_SL1500_.jpg"
  ],
  [
    "Razer Gaming Mouse Bungee V3: Drag-Free Wired Mouse Support - for Esports-Level Performance - Weighted Base - Anti-Slip Feet - Classic Black",
    "The #1 Best-Selling Gaming Peripherals Manufacturer in the US: Source - The NPD Group, Inc., U.S. Retail Tracking Service, Gaming Designed: Keyboards, Mice, PC Headsets, and PC Microphones, Based on dollar sales, Jan. 2017- June 2020 combined.",
    19.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/71fDexoHa3L._AC_SL1500_.jpg"
  ],
  [
    "Downy Fabric Softener Liquid, Cool Cotton Scent, 140 fl oz, 190 Loads",
    "Give your clothes a softer feel and a long-lasting airy scent with Downy Cool Cotton Fabric Softener. Downy Fabric Softener soothes the senses routinely with every wash, giving the fabrics a delightful softness to touch and a revitalizing clean scent. Downy Liquid Fabric Softener is compatible with all top- and front-loading HE machines. It's easy to use—after adding your favorite laundry detergent, pour Downy Liquid Fabric Softener into the fabric softener dispenser drawer or directly into the agitator and start the washer on your preferred cycle. Have clothes that are softer, gentler, and better* with Downy 2 in 1: Soft and Fresh. *Vs. detergent alone",
    12.97,
    "Health & Household",
    "https://m.media-amazon.com/images/I/71FxmK9qiHL._AC_SL1500_.jpg"
  ],
  [
    "5 Rolls Extra Long Teflon Tape 1/2 Inch(W) X 520 Inches(L) - Plumbers PTFE Tape – Thread Seal Perfect for Shower Heads and Pipe - Home Plumbing Pipe Sealing - Sealant Tape",
    "TEFLON TAPE PTEF MaterialWATER PROOFHEAT/COLD ResistantHIGH PRESSURE RESISTANT     Sealant tape is made of good density teflon material that will not harden or crack. They have the good characteristics of sealing, corrosion resistance, and anti-aging.   Easy to use Clean up the two threaded interfaces that need to be sealed. Wrap the end of the Teflon tape around the internal thread interface. NOTE: The winding direction should be consistent with the direction of rotation of the two interfaces.Screw the thread interface to the internal thread interface wrapped with tape and tighten it.   Thread sealant tape is suitable for most kinds of soft water pipes, creating airtight seals between threaded pipes and fittings. Works for both air and water, it is designed for home and piping applications. EXTENSIVE USE   The Plumbing Tapes are compatible with all kind of pipes, shower heads, sink drain, faucet, hose, and triangle valves. You will get 5 rolls of teflon tape in one package. Teflon Tape 5 Pack Teflon Tape 1 Pack Electrical Tape 3 Pack Electrical Tape 6 Pack Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.6 out of 5 stars 2,056 4.6 out of 5 stars 277 4.6 out of 5 stars 1,109 4.6 out of 5 stars 1,109 Price $5.99$5.99 $3.25$3.25 $4.45$4.45 $4.99$4.99 Pack Size 5 Rolls 1 Roll 3 Rolls 6 Rolls Size 1/2 inch x 2600 inch 1/2 inch x 520 inch 3/4 inch x 198 feet 0.6 inch x 156 feet Material Teflon Teflon Polyvinyl Chloride Polyvinyl Chloride Color White White Black Muticolor Thickness 7 mil 7 mil",
    5.99,
    "Industrial & Scientific",
    "https://m.media-amazon.com/images/I/71zlw9r+DOL._SL1500_.jpg"
  ],
  [
    "Topfinel Decorative Throw Pillow Covers Cushion Cases, Set of 4 Soft Velvet Modern Double-Sided Designs, Mix and Match for Boho Farmhouse Fall Home Decor (18x18 inch, Orange/Teal)",
    "About this item Corduroy Size & Material: 4 pieces 45 x 45 cm pillowcases without pillow filling.Made of soft corduroy.very eco-friendly.durable.without unpleasant odor.The pillowcases are skin-friendly and ideal for children.also pets. Gradient design：The 4 colors are beautifully matched.The decorative pillowcases are super soft and durable.Makes fun.Also very good as a gift for family. Friends and colleagues. Zipper:The invisible zipper with very good sturdy workmanship. provides a very clean look.It also has the same color as pillowcases. Wash and care：The pillowcases are easy care and non-iron.Machine washable and tumble dry at low temperature.Do not bleach. Scope of delivery and warranty:Decorative pillowcases set of 4. No pillow filling.Topfinel has more than 10 years experience in textiles field.If you have any further question. we are always here for you. › See more product details",
    23.99,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/81Bu0nsrbHL._AC_SL1500_.jpg"
  ],
  [
    "LTROP Kids Case for iPad 10th Generation 10.9 Inch 2022, iPad 10.9 Case 10th Generation, with Shoulder Strap, Durable Light Weight Handle Stand Child-Proof Bumper Case for iPad 10th Gen 2022, Blue",
    "Cute 10.9 Inch iPad 10th Generation Case for Kids - Easy to Carry   Durable Lightweight Child-proof Kids Case for iPad 10th Generation 10.9\"   Portable iPad 10th Generation Case with Shoulder Strap Handle Kickstand   Previous page Next page 1 Case details 2 Easy to carry 3 Available on the go Lovely iPad 10.9 Inch 10th Generation Case for Kids Toddler Baby Boys & Girls   Please Confirm The Compatibility Before Place An Order - For iPad 10.9 Inch   Does this case fit iPad 10.9 inch 2022 iPad 10th generation? YES! It's exclusively designed for iPad 10th generation 10.9 inch Model number A2696, A2757,A2777. Does this case fit iPad Air 10.9\" ( iPad air 4th &5th generation ) ? Yes ! It fits iPad Air 10.9\" 2022/2020 (4th/5th Gen) Model A2591, A2589, A2072, A2316, A2324, A2325. Does this case come with screen protector? No! It's without screen protector. It's suggested to buy extra tempered glass to work with the case if needed. Does it come with a strap? Yes, it's with a detachable shoulder strap, easily take your iPad 10.9\" anywhere you need it. Can this case be used as a bumper case? Yes, It's made of shockproof kid-friendly material, protect your new iPad 10th gen from bumps and drops effectively.",
    15.98,
    "Electronics",
    "https://m.media-amazon.com/images/I/71XDdCn7BVL._AC_SL1500_.jpg"
  ],
  [
    "Ziploc Snack Bags with EasyGuide Texture, Small Plastic Storage Bags with Grip 'N Seal Technology, 270 Bags Total",
    "Ziploc Snack Bags can help you unlock lunches, snacks, supplies, and more. These resealable plastic bags are the perfect size for storing celery sticks, baby carrots, grapes, chips and other yummy treats. The EasyGuide Texture makes it easy to zip with no slip so you can be sure your snacks are secure. Hands of all sizes can zip confidently with Grip 'N Seal technology. Ziploc bags are BPA free. Keep a box of small food storage bags in the pantry so you're always ready for packing lunch or snacking at a moment's notice. Use mini plastic bags to help keep your fruit and veggies fresh in the fridge. Ziploc bags are not formulated with BPA.",
    14.29,
    "Health & Household",
    "https://m.media-amazon.com/images/I/91zsVViBlGL._AC_SL1500_.jpg"
  ],
  [
    "PAWLAND Extra Wide Dog gate for The House, Doorway, Stairs, Dog Fences Indoor, Freestanding Foldable Wooden Pet Gates for Dogs, Set of Support Feet Included, 96 in Wide 30 in Tall, 4 Panels White",
    "20 in Freestanding Dog Gate 4 Panels 20 in Freestanding Dog Gate 4 Panels with Door Walk Through 24 in Freestanding Dog Gate 4 Panels 24 in Freestanding Dog Gate 4 Panels 24 In Outdoor Waterprooof Dog Gate Cat Litter Box Enclosure with Storage Shelf Add to Cart Add to Cart Add to Cart Add to Cart Buying Options Buying Options Customer Reviews 4.6 out of 5 stars 577 4.6 out of 5 stars 577 4.4 out of 5 stars 7,630 4.4 out of 5 stars 7,630 4.1 out of 5 stars 90 4.0 out of 5 stars 33 Price $69.99$69.99 $85.99$85.99 $99.99$99.99 $149.99$149.99 — — For Who Dogs Dogs Dogs Dogs Dogs Cats Open Size 80” W x0.75” D x 24” H 80” W x0.75” D x 24” H 96” W x0.75” D x 31.2” H 144’’W x 0.7’’D x 32.08” H 96” W x0.75” D x 31.1” H 18.9\"W x 35.4\"D x 19.7\"H Weight 20.2 Pounds 21.9 pounds 31 Pounds 34.4 pounds 21 Pounds 55.7 Pounds No Assembly Required ✓ ✓ ✓ ✓ Application Scenarios living room, doorway, kitchen, bedroom, hallway, balcony etc. living room, doorway, kitchen, bedroom, hallway, balcony etc. living room, doorway, kitchen, bedroom, hallway, balcony etc. living room, doorway, kitchen, bedroom, hallway, balcony etc. living room, doorway, kitchen, bedroom, hallway, balcony etc. living room, doorway, kitchen, bedroom, hallway, balcony etc.",
    99.99,
    "Baby Products",
    "https://m.media-amazon.com/images/I/81JRWm1ggbL._AC_SL1500_.jpg"
  ],
  [
    "One A Day Men’s 50+ Healthy Advantage Multivitamin, Multivitamin for Men with Vitamins A, C, E, B6, B12, Calcium and Vitamin D, Tablet, 200 Count (Pack of 1)",
    "One A Day Men's 50+ Healthy Advantage Multivitamins offer 100% or more of the Daily Value of at least 15 key nutrients in a single tablet. One A Day Men's 50+ Healthy Advantage is designed to address health concerns of men as they age. This daily multivitamin contains Vitamins A, C, and E, Zinc, Selenium, Copper and Manganese to support cell health.* One A Day Men's 50+ Healthy Advantage is Formulated to support:** cell health, heart health^, healthy blood pressure**, immune health, physical energy* by helping convert food to fuel, and eye health.* One A Day Men's 50+ Healthy Advantage Multivitamin is free of gluten, wheat, dairy, artificial flavors, and artificial sweeteners. Men over the age of 50 should take one tablet daily with food. One A Day Multivitamins provide nutritional support that you and your family may need at any life stage. ^Not a replacement for heart medications. **To help support blood pressure levels already within the normal range *This statement has not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.",
    19.98,
    "Health & Household",
    "https://m.media-amazon.com/images/I/71Nt-rDOshL._AC_SL1500_.jpg"
  ],
  [
    "Canon PIXMA TS6420a All-in-One Wireless Inkjet Printer [Print,Copy,Scan], Black, Works with Alexa",
    "Wireless Home Office All-In-One Printer",
    129.99,
    "Office Products",
    "https://m.media-amazon.com/images/I/61x6KTFR8yL._AC_SL1500_.jpg"
  ],
  [
    "Waterdrop WD-PF-AL Replacement Alkaline Filters for All Waterdrop Pitcher and Dispenser Filtration System, Improved Coffee Taste, Last Up to 100 Gallons (Pack of 3)",
    "Adds beneficial minerals Adds potassium, calcium, strontium, sodium, magnesium, zinc, and other minerals to your water. Drink more water every day with Waterdrop. Regulates the pH value Alkaline water helps slow down the aging process and regulate the pH value of your body. Provides long service life Provides up to 100 gallons of pure water to you and your loved ones. You can trust Waterdrop to offer safe drinking water for the entire family.       Pitcher filter with safety This filter is made of high-grade BPA-free plastic and premium materials to improve the user experience and the water’s taste. Pitcher filter with health The pitcher helps you stay hydrated at any time. When you drink a sufficient amount of water, your skin will stay moisturized. Pitcher filter with multiple uses You can drink the filtered water directly or add it to your coffee maker for a more delightful aroma. It offers healthy water in almost any situation.",
    39.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/61IrGuU7o+L._AC_SL1500_.jpg"
  ],
  [
    "title",
    "description",
    null,
    "categories",
    "image_url"
  ],
  [
    "etguuds 6ft USB A to USB C Cable 3A Fast Charging, 2-Pack USB A to USB Type C Charger Cord for iPhone 16 15 Pro/Pro Max/Plus, for Samsung Galaxy S24 S23 S22 S21 S20 S10 A55 A54 Flip Note, Moto, Gray",
    "Compatible with: - Compatible with iPhone 16/ 16Pro/ 16Plus/ 16Pro Max / 15/ 15Pro/ 15Plus/ 15Pro Max -Compatible with Galaxy S24/ S24+/ S24 Ultra, S23/ S23+/ S23 Ultra, S22/ S22+/ S22 Ultra, S21/ S21+/ S21 Ultra, S20/ S20+/ S20 Ultra, S10 S10e S10+ Plus 5G S8 S8+ S9 S9+ S8 Plus S9 Plus, A12 A13 A51 A52 A53 A60 A70 A71 A72 A80 A90, Note 9 Note10 Note 10+ Plus 5G Note 20, M42 M40 M31 M30 M30s -Compatible with Pixel 9 8 8a 8Pro 7 7a 7Pro 6 6a 6 pro 5 5a 4 4a 3 2 XL -Compatible with Mo-to G Stylus G Power G Fast G Play G50 Edge, Moto Z Force Z Play Z2 Force Z2 Play -Compatible with G5 G6 G7 V60 V50 V40 V35 ThinQ V30S V30 V20 Stylo 4 5 6 Velvet This usb c cable does not support fast charging for the following devices : - for Samsung Galaxy Note 10/Note 10+ - for Pixel 4 / Pixel 4 XL / Pixel 3 / Pixel 3XL Fast Charging Warm Tips: 1.This is a USB-A to USB-C cable, NOT USB-C to USB-C cable. 2.If your device's original cable is a USB-C to USB-C cable, then only a USB-C to USB-C cable can charge your device as fast as possible. 3.This cord WILL NOT provide you with fast charging alone, you will need a power block rated for fast charging and a phone capable of the same. 4.Friendly Tips: You will get etguuds USB A to USB C braided nylon cable, please confirm the length of the cables before buying, the length of the included cable connector.               Charge your device with 3A fast charge technology, built-in 56KΩ resistor incredible safety, protect your devices and charging adapters from damage. Internal 21/28AWG thick tinned copper core, with aluminum foil signal shielding layer for faster and more stable charging. Built-in 56kΩ resistor provide outstandingly reliable conductivity and stability Strong military fiber can be use for long time. The most flexible, powerful and durable braided material, makes tensile force increased by 200%. Special Strain Relief design, can bear 20000+ bending test",
    9.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/61AsLefMRqL._AC_SL1100_.jpg"
  ],
  [
    "Ready Set Food Organic Puffs – Early Allergen Introduction Snack Puffs w/ 9 Top Allergens: Organic Peanuts, Cashew, Egg & More, No Added Sugar, Babies 8+ Months (Peanut Butter, 2 Pack)",
    "Previous page Next page   Previous page Next page How many RSF! Organic Puffs can my baby eat in a single day? We recommend a diverse diet for all children, so eating all foods in moderation is always beneficial. Eating too many of any one type of food doesn’t leave room for other nutritious and diet-diverse foods in little tummies. When can I start using RSF! Organic Puffs? After introducing allergens, you can use our Organic Puffs to help maintain the exposure. Our Organic Puffs are recommended for ages 8 months and up. This product should be fed to seated, supervised children who are accustomed to eating solid foods. Is there any added sugar in RSF! Organic Puffs? There is no added sugar in our Organic Puffs. To view the nutritional facts on each of our Organic Puffs, click here for the Peanut Butter flavor and click here for the Daniel Tiger Apple Cinnamon flavor. What is the allergen dose of each serving of RSF! Organic Puffs? Each serving of puffs is equivalent to ½ serving of Stage 3 Mix-Ins packets. How are RSF! Organic Puffs different from peanut puffs that aren’t labeled for toddlers? Ready. Set. Food! Organic Puffs are designed with a softer, easy to dissolve texture that is easier for babies to eat and contains top 9 allergens to help maintain exposure and encourage diet diversity. Explore More Products 8+ Months Recommended Age 6+ Months 9 Top Allergens Allergens 3 Top Allergens Resealable Pouch Format Pouch Certified Organic Non-GMO Good Source of Iron 4 Number of Flavors 3 8+ Months Recommended Age 12+ Months 9 Top Allergens Allergens 8 Top Allergens Resealable Pouch Format Individually Wrapped Certified Organic Non-GMO Good Source of Iron 4 Number of Flavors 2 8+ Months Recommended Age 6+ Months 9 Top Allergens Allergens 9 Top Allergens Resealable Pouch Format Resealable Pouch Certified Organic Non-GMO Good Source of Iron 4 Number of Flavors 5 8+ Months Recommended Age 6+ Months 9 Top Allergens Allergens 3 Top Allergens Resealable Pouch Format Resealable Pouch Certified Organic Non-GMO Good Source of Iron 4 Number of Flavors 2 Previous page Next page Learn More Learn More Learn More Learn More",
    13.99,
    "Baby Products",
    "https://m.media-amazon.com/images/I/81+N3WlvQVL._SL1500_.jpg"
  ],
  [
    "Sondiko Butane Torch with Fuel Gauge S907, Refillable Soldering Torch Lighter with Adjustable Flame for Welding, Resin Art, Industrial(Butane Gas Not Included)",
    "Sondiko Professional Kitchen Culinary Torch Looking for a versatile kitchen torch that won't break the bank? Look no further than the Sondiko Professional Kitchen Culinary Torch! With its easy-to-use design and fuel gauge, this torch is perfect for everything from creme brulee to flambe. YOUE VERSATILE KITCHEN ASSISTANT. Sondiko Butane Torch with Fuel Gauge S907 Whether you're heating up a meal while camping or crafting a work of art, the Sondiko Butane Torch has you covered. With its sleek and stylish design, you'll be able to enjoy delicious and perfectly cooked meals right at home. So why wait? Get your Sondiko Cooking Torch today and take your cooking to the next level! The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.   What's Included? Easily Make Delicious Meals with Electronic Recipes and Our Kitchen Torch. *S907 Kitchen Torch *Manual *1 Recipe Ebook *‎Red Inflatable Accessories Sondiko S Series Kitchen Torch with Butane Refill S907 Buying Options S400 Buying Options S901 Buying Options HB1513 Toroch Kit Buying Options S928 with Butane Refill Buying Options Customer Reviews 4.6 out of 5 stars 38 4.7 out of 5 stars 76 4.5 out of 5 stars 9 5.0 out of 5 stars 2 5.0 out of 5 stars 2 Safety Lock ✔ ✔ ✔ ✔ ✔ Adjustable Flame ✔ ✔ ✔ ✔ ✔ Refillable ✔ ✔ ✔ ✔ ✔ Continuously Flame Mode ✔ ✔ ✔ ✔ ✔ Inflatable tool ✔ ✔ ✔ ✔ ✔ Fuel Gauge ✔ ✘ ✘ ✘ ✘ with Butane Refill ✔ ✔ ✔ ✔ ✔",
    18.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/61rylqOvObL._AC_SL1000_.jpg"
  ],
  [
    "Nylabone Power Chew Classic Bone Chew Toy for Dogs, Durable Dog Toys for Aggressive Chewers, Original Flavor, Medium/Wolf - Up to 35 lbs. (1 Count)",
    "Give your dog something fun to chew on! Made from our toughest material, this Power Chew durable dog chew toy entertains extreme chewers and encourages non-destructive chewing habits. It features delicious flavor dogs love throughout, giving your furry friend even more to smile about. Speaking of smiles, this chew toy also helps clean teeth and control plaque & tartar as dogs chew. Satisfy your best friend’s natural urge to chew with this this occupying, USA-made chew toy!What your dog chews matters! With destructive behavior among the leading reasons dogs are returned to shelters, we know healthy habits can make a life-changing difference. For 70 years, our family-founded brand continues to safely satisfy dogs’ chewing instincts and help them stay in loving forever homes!",
    8.89,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/81nglpv2hXL._AC_SL1500_.jpg"
  ],
  [
    "Catstages Crunchy Pickle Kicker Dental Catnip Cat Toy",
    "The Crunchy Pickle Kicker dental cat toy from Petstages is made with multiple textures and sounds to be quite the big dill! Your kitty will enjoy the intriguing crinkle sound and catnip stuffing that promote your kitty's wellness, mental stimulation. and add extra interactive elements of fun. These dental cat toys feature mesh fabric that helps remove soft tartar and plaque while being gentle on the gums. The elongated shape of this dental cat toy makes it perfect for bunny-kicks and batting—two favorite ways for cats to play! Always supervise. Not for aggressive chewers. SAFETY AND CARE: When choosing a toy, make sure to choose the appropriate size for your cat. No toy is indestructible. ALWAYS supervise your cat when using a toy of any kind. Inspect toys regularly for damage and remove if broken, or if parts become separated, as serious injury may result. Intended for cats only. Keep out of reach of children. This item is not recommended for cats that chew heavily.",
    5.59,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71DQ7TfBFsL._AC_SL1500_.jpg"
  ],
  [
    "Dimmable E12 Candelabra LED Light Bulbs 40W Equivalent, 2700K Soft Warm White Chandelier Light Bulbs, 4W 460 LM Flame Tip Candle Light Bulbs, 12-Pack",
    "Provide Energy-Efficient and Long-Lasting Lighting! Previous page Next page Allows You to Adjust the Brightness to Your Preference! These LED light bulbs are easy to install and are designed to replace standard light bulbs, including light bulbs 60 watts. Previous page Next page 1 Select Desired Color 2 Fully Dimmable Bulbs Perfect for Chandeliers, Wall Sconces, and Other Fixtures!   Give Your Light Fixtures a New Look! Previous page Next page",
    19.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71hIaOHchXL._AC_SL1500_.jpg"
  ],
  [
    "3.5” Spike Dog Balls with Squeaky, Thicker and Durable, 2 Pack Dog Chew Toys Clean Teeth Training for Puppy Small Medium Large Dogs, Dog Ball Toys for Aggressive Chewers",
    "ABOUT PWEITUOET Dogs are the most loyal friends of human beings, they accompany us and give us funny, they are an important part of our family. PWEITUOET is committed to making a variety of different types of toys to meet the needs of pup small dogs medium dogs large dogs. We follow high quality production principles to produce higher quality products and provide safe and durable toys for dogs. SIX BENEFITS FOR DOGS     Playing with fur kids is the best way to enhance relationship. Our squeaky dog balls are very good training dog toys, high elasticity, suitable for playing fetch game, bright color is easy for dogs to find it, good choice for indoor or outdoor game. Have fun playing with your pet!",
    11.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71dLVzd7bjL._AC_SL1500_.jpg"
  ],
  [
    "MaxWorks 80697 Heavy Duty Indoor/Outdoor Triple Tap 3 Ft. Extension Cord -16 AWG/3C-ETL Approved",
    "Easily converts a single 3-prong to triple outlets. Triple block lights up when connected to power. Rugged solid molded vinyl connector will impact and will stand up on rough use on work-sites. Flexible and water resistant cord. Grounded 3-prongoutlets ideal for your power tools and outdoor equipment. 16/3 SJTW heavy duty cord. 125VAC, 15 AMPS, 1875 WATTS. Eliminates clutter when running multiple cords.",
    7.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71q9FzIhV4L._SL1500_.jpg"
  ],
  [
    "Vgogfly LED Refrigerator Light Bulb 40W Equivalent 120V A15 Fridge Waterproof Bulbs 5 W Daylight White 5000K E26 Medium Base Freezer Home Lighting Lamp Non-dimmable(2 Pack)",
    "Specifications Wattage: 5W Equivalent wattage: 40W Luminous flux: 550lm Color temp: daylight white Beam angle: 360 degree CRI>80 Base: E26 Working temp: -4° F - 113° F These are some of the features of the Refrigerator Light Bulb Our mission In Vgoglfy, our goal is to provide quality energy-saving lighting products for our customers. With the expertise in the LED technology, our product not only superior in performance but also make your lighting experience more enjoyable and comfortable anytime, anywhere. Tip:Turn off the power before you install the bulb         With CRI=80Ra With CRI=80Ra, more vivid and natural lighting for your refrigerator. Wide Application with low power Widely used in refrigerator, bathroom with steam shower, ceiling fan light fixtures, reading lamp and other home home light fixture, etc. Refrigerator Bulb waterproof, work -20℃-45℃, perfect light bulb for your refrigerator, more energy saving than the incandescent bulb",
    9.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/51y-NudAJDL._AC_SL1001_.jpg"
  ],
  [
    "Stainless Steel Salt and Pepper Shaker Set with Glass Bottom, Perforated \"S\" and \"P\" Caps - Modern Kitchen Counter Decor (4oz)",
    "Transform Your Seasoning Game with Style and Precision The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. This stainless salt and pepper shaker set provides a simple yet effective way to add flavor to your meals. These shakers boast a modern and sophisticated design that imparts a touch of refinement to your table while helping to keep your seasonings fresh and full of flavor. Add a Dash of Flavor to Your Dishes Previous page Convenient 4-Ounce Capacity With a 4-ounce capacity, these shakers are a great size for everyday cooking, holding just the right amount of salt and pepper without taking up too much space on your table or countertop. Sleek and Stylish Design The modern and tasteful design of these shakers will elevate the style of your kitchen or dining room, adding a hint of elegance to your home. Quality You Can Count On Made with durable stainless steel and high-quality glass, these shakers are built to last and withstand daily use in a busy kitchen. Easy to Clean Maintaining these salt and pepper shakers is a breeze, as they can be easily wiped clean with a damp cloth or rinsed under running water. Next page Cook in Confidence with Perfectly-Sized Shakers With a compact 4-inch height, these stainless steel salt and pepper shakers are perfectly sized to make a striking impression on your kitchen counter or dining table without taking up too much space. Their sleek and minimalist design complements any kitchen decor effortlessly.     See Our Collection! Salt & Pepper Shakers Add to Cart Salt & Pepper Shaker Set Add to Cart Salt & Pepper Shakers Add to Cart Salt & Pepper Shakers Add to Cart Salt & Pepper Shakers Add to Cart Oil & Vinegar Caddy Add to Cart Customer Reviews 4.7 out of 5 stars 28,100 4.7 out of 5 stars 5,064 4.6 out of 5 stars 457 4.6 out of 5 stars 457 4.5 out of 5 stars 2,164 4.4 out of 5 stars 1,041 Price $8.99$8.99 $9.99$9.99 $9.49$9.49 $9.59$9.59 $8.99$8.99 $22.49$22.49 Quantity 2 Piece Set 3 Piece Set 2 Piece Set 2 Piece Set 2 Piece Set 5 Piece Set Size (in) 4 in 4 x 6 in 4.5 in 4.5 in 2 x 3 in 4.7 x 11 in Color Silver Silver Copper Teal Silver Clear Capacity 4 oz 4 oz 4 oz 4 oz 2 oz 9 oz + 4 oz Includes Holder ✘ ✔ ✘ ✘ ✘ ✔ Material Stainless Steel+Glass+Plastic Stainless Steel+Glass+Plastic Stainless Steel+Glass+Plastic Stainless Steel+Glass+Plastic Stainless Steel Stainless Steel+Glass",
    13.99,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/71nS5mXCbwL._AC_SL1500_.jpg"
  ],
  [
    "Litter Pearls Crystal Cat Litter with Odorbond- Superior Odor Control, Soft-On-Paws, Low Dust, 7lb, Micro Fresh, White, Clear and Blue Crystals",
    "Litter Pearls Micro Fresh cat litter with ODORBOND is the ultimate non-clumping litter for odor control. Litter Pearls was the first U.S. brand of crystal cat litter and is made with the highest quality Silica Gel crystals available. Silica Gel is safe, non-toxic and allergen-free. Not only are Litter Pearls crystals safe for cats and people, they are also lightweight with high absorbency properties, requiring less litter than clay and other types of litters. This means, using Litter Pearls, less litter per cat ends up in the landfill. Micro Fresh’s powerful odor control is supplied by ODORBOND(tm) Technology, a proprietary, safe additive which neutralizes ammonia odors on contact. When used as directed Litter Pearls Micro Fresh will control ammonia odors for up to 30 days, keeping the litter box fresher, longer. Micro Fresh crystals have a Fresh Scent and are super soft on cats' paws for maximum comfort and a more pleasant litter experience.",
    24.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/712TgRcakfL._AC_SL1500_.jpg"
  ],
  [
    "GoSports Pets PupsCream Freezable Dog Treat Station - Helps Keep Dogs Busy - Small or Large",
    "GoSports PupsCream is a new and exciting frozen treat holder for your dog. Fill it with various dog-friendly snacks like broth, yogurt, or peanut butter, and then freeze it for a long-lasting treat to keep your dog busy. Unlike traditional treat holders that move or bounce around, the PupsCream sits flat and grips the ground, keeping your dog occupied in one place to prevent messes around your home. This 8-inch-sized treat holder is suitable for dogs over 30 lbs and can hold up to 2 ounces. Cleaning is a breeze, PupsCream is dishwasher safe (top rack) or can be washed by hand. Made from food-safe natural rubber, PupsCream offers a durable and safe option for rewarding your dog with tasty frozen treats!",
    9.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/81P0AgXSMTL._AC_SL1500_.jpg"
  ],
  [
    "CORSAIR VOID RGB ELITE Wireless Gaming Headset – 7.1 Surround Sound – Omni-Directional Microphone – Microfiber Mesh Earpads – Up to 40ft Range – iCUE Compatible – PC, Mac, PS5, PS4 – Carbon",
    "Immerse yourself in the action with the Corsair void RGB Elite wireless, with custom-tuned 50mm neodymium audio drivers delivering 7.1 surround sound on the PC. Microfiber mesh fabric and memory foam ear pads provide lasting comfort. Connect to your PC or PS4 with a low-latency 2.4GHz wireless connection, with a range of up to 40ft and all-day battery life up to 16 hours. An omnidirectional microphone with LED mute indicator ensures that you're heard with exceptional vocal clarity. The void RGB Elite's distinctive design and durable construction are complemented by fully customizable RGB lighting on each ear cup. Powerful Corsair iCUE software ties everything together, enabling full control over equalizer settings, 7.1 surround sound, RGB lighting and more.",
    109.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/61oGokyedML._AC_SL1500_.jpg"
  ],
  [
    "LED Refrigerator Light Bulb 40 Watt Equivalent, 120V Fridge Appliance Light Bulb 4W Daylight White 5000K, Waterproof A15 Fridge Light Bulbs 450LM, E26 Freezer Light Bulbs Non-dimmable, 2Packs",
    "Brightever A15 Refrigerator Light Bulbs   Previous page Next page 1 Waterproof Frige Bulbs 2 Non-Dimmable 3 Higher CRI 4 High Brightness 5 No Flicker Previous page Next page Ideal for house, hotel, offices, restaurants or any other places 1 Refrigerator Bulbs 2 Kitchen Lights 3 Indoor Light Bulbs 4 Living Room Bulbs What's the base of these light bulbs? We Brightever A15 led bulbs are E26 base. Is it bright enough for lighting all my refrigerator? These led light bulbs are 40 Watt Equivalent, emmiting 450 LM brightness, which will be pretty bright enough. More Choices for Your House Lighting Outdoor String Lights Add to Cart 100W ST64 LED Bulb Add to Cart 4W T6 Candelabra LED Bulb Add to Cart Under Cabinet Lighting Add to Cart Solar Pathway Lights Add to Cart Solar Motion Lights Add to Cart Customer Reviews 4.6 out of 5 stars 2,369 4.6 out of 5 stars 173 4.6 out of 5 stars 857 4.2 out of 5 stars 126 4.6 out of 5 stars 88 4.5 out of 5 stars 1,190 Price $32.99$32.99 $14.99$14.99 $8.99$8.99 $29.49$29.49 $34.99$34.99 $17.99$17.99 Color 2700K Warm White 2700K Warm White 2700K Warm White 3 Colors in 1 Warm White + RGB 6000K Cool White Material Premium Plastic Metal + Glass Metal + Glass Aluminum + Acrylic + Plastic Iron + PC ABS + PC Energy-Saving ✔ ✔ ✔ ✔ ✔ ✔ High-Efficienct ✔ ✔ ✔ ✔ ✔ ✔ Dimmable ✔ ✘ ✔ ✔ ✘ ✔",
    9.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/61RdeQmh44L._AC_SL1500_.jpg"
  ],
  [
    "AXE Body Wash Apollo 4 Count for Long Lasting Freshness Sage & Cedarwood Men's Body Wash with Odor-Busting Prebiotics 16 oz",
    "Lather up and smell the freshness. You never know what’s just around the corner. Or who. Smell your best whenever, wherever. Relax. We got you. With 12-hour refreshing scent, AXE Apollo Body Wash for Men busts bad odor and keeps you shower-fresh. All. Day. Long. Refreshing, effortless and deliciously foamy, let the crisp notes of sage and cedarwood combine to leave you clean, fresh and ready. Same great AXE Apollo men's fragrance, fresh new look. But what’s on the inside matters too. Wash away odor and smell refreshed for 12 hours with our first Dual Action Body Wash, now with upgraded fragrances. Plus, our 100% plant-based natural moisturizers keep your skin feeling irresistibly soft, naturally. All day, all night no matter what, you’re ready. Fresher you, cleaner planet. By 2025, AXE aims for all our packaging to be recyclable or to include recycled materials our Body Wash bottles are already made with 100% recycled plastic. The key to attraction is an outstanding fragrance. AXE is dedicated to giving you all the tools so whenever opportunity arises, you smell your absolute, irresistible best. From our body sprays to our men's body wash, our antiperspirants to our deodorants, we’re doing everything we can to make sure no one gets left out of the attraction game. Welcome to the future. It smells amazing. New and Upgraded AXE. Smell Ready.",
    17.96,
    "Beauty & Personal Care",
    "https://m.media-amazon.com/images/I/91gfGLYTB9L._SL1500_.jpg"
  ],
  [
    "Snuggle Puppy Plus with 3 Heat Packs & All New Smartbeat Motion Activated RealFeel Heartbeat, Pet Anxiety Relief and Calming Aid - Comfort Toy for Behavioral Training (Bernese)",
    "The First Smart Anxiety Solution Your Dog Turns On and Off! Snuggle Puppy PLUS is the only plush featuring a SmartBeat Heart with motion activated technology! The heartbeat turns on/off based on your dog’s movement, ensuring your dog’s best friend is always there when they need it the most. Meet the new Snuggle Puppy Plus: Your Dog's New Best Friend For Life!   Naturally Eases Anxiety Patented Motion Activated Real-Feel Heartbeat Technology that pulses to calm anxiety and soothe your pup to sleep (3 Heat packs Included)   Easy-to-use Two heartbeat options: Option 1 - Motion Activated. Option 2 - Continuous running for 8 hours. Choose the best fit for your needs.   New Styles Two new styles, Bernese Mountain Dog (inspired by our original office dog, Stanley!) and Black & White, mimicking a Border Collie and other breeds!   Designed By The Puppy Experts Trusted by millions of new puppy parents worldwide for over 25 years. The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.   The First Smart Anxiety Solution Your Dog Turns On/Off on Their Own! Snuggle Puppy PLUS is the only plush featuring a SmartBeat Heart with motion activated technology! The heartbeat turns on/off based on your dog’s movement, ensuring your dog’s best friend is always there when they need it the most. SmartBeat Technology Our advanced Motion Activated Real-Feel Heartbeat is designed to soothe and calm your puppy or dog. It turns on when your dog moves and turns off when the heartbeat no longer senses motion. There is no longer a need to open Snuggle Puppy to turn it on/off– PLUS, enjoy an extended battery life of 6+ months!   Pet Calming Solution   All Natural and Easy to Use Snuggle Puppy PLUS recreates that intimacy of a pup’s mother and pack with physical warmth and a SmartBeat Heart with a Real-Feel Heartbeat. This all-natural solution makes life easy for you as a pet parent. A happier, more peaceful pet = a happier, more peaceful you!   A Comfy Best Friend For Your Dog Whether it is crate training, a new home, fireworks or perhaps a storm, Snuggle Puppy PLUS is there to comfort your four-legged friend. The innovative motion activated “Real-Feel” heartbeat is designed to provide comfort and relieve anxiety— helping YOU and your dog get quality rest!   Millions of Pets Comforted Since 1997 Our US based customer response team is second to none and here to help with any questions you have. We’re honored to help make life easier for you as a pet parent.",
    49.95,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71igtvZzzaL._AC_SL1500_.jpg"
  ],
  [
    "Rare Replay – Xbox One",
    "To celebrate its 30th anniversary, Rare brings together the adventures of its iconic characters in a collection that spans the decades. From its earliest 2D classics to Xbox 360 triumphs, Rare Replay delivers a gaming treasure trove for veteran players and newcomers alike. As you brawl with the Battletoads, grab Jiggies in Banjo-Kazooie and fight the future in Perfect Dark, you’ll uncover bonus content and exclusive looks at the creation of Rare Replay’s hits. Master the basics or test your skills with all-new snapshot challenges and 10,000 Gamerscore. Gaming’s greatest are back, lovingly presented and exclusively on Xbox One!",
    19.93,
    "Video Games",
    "https://m.media-amazon.com/images/I/81s9mAkhuZL._SL1500_.jpg"
  ],
  [
    "GE Advanced Silicone Caulk for Window & Door - 100% Waterproof Silicone Sealant, 5X Stronger Adhesion, Freeze & Sun Proof - 2.8 fl oz Tube, Clear, 1 Pack",
    "GE Advanced Silicone Caulk for Window & Door - 100% Waterproof Silicone Sealant, 5X Stronger Adhesion, Freeze & Sun Proof - 2.8 fl oz Tube, Clear, 1 Pack",
    7.78,
    "Industrial & Scientific",
    "https://m.media-amazon.com/images/I/61rzExJ7FdL._SL1500_.jpg"
  ],
  [
    "GE LED Light Bulbs, 60 Watt, Daylight, A19 (4 Pack)",
    "A simple way to shop for light bulbs: by room. Each bulb in our LED series enhances different colors, creating the perfect mood where you need it. So if you know the room, you know the light.",
    11.76,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71-YnemQBJL._AC_SL1500_.jpg"
  ],
  [
    "Pet Magasin Highly Absorbent Reusable Washable Pet Pads for Crate or Training with Waterproof Bottom (Pack of 3) (Pack of 3) (Grey, 21x15 Inch)",
    "Pet Magasin Reusable Dog Training Pads are a better and sustainable choice than continue buying disposable pads while potty training your dog or managing incontinence issues with older pets. Not only it reduces waste but it also saves money when it comes to caring for our environment. We at Pet Magasin spend countless hours in developing, sourcing, and testing our products. Our primary concerns are that everything we make is safe for pets and their owners, a quality item, and has great value. We source our materials from all over the world: Our scissor sets are made with fine Japanese steel, we buy U.S.-grown cattle hides for our rawhide dog treats, and our catnip is grown in Canada just to name a few. We strive for our products to have style as well as quality. When appropriate, we incorporate cheerful colors without sacrificing the safety and integrity of our products. The items that are used by pet owners are designed to be as ergonomic and comfortable to use as possible. And of course, all of our products are made and sold with your pet's safety, wellbeing, and enjoyment pleasure in mind. Why Pet Magasin Reusable Dog Training Pads?       ECONOMICAL & SUSTAINABLE Set of 3 reusable dog training pads with multiple sizes. Our dog training pads are easier on your budget and the environment than disposable pads. Disposable pads are like throwing your cash into a landfill! MACHINE WASHABLE & MACHINE DRYABLE Just pick up the pad and drop it in the washer, using a gentle cycle. Tumble dry and your dog training pad will be as fresh as when it was new! SUPRERIOR ABSORPTION & ODOR CONTROL These dog training pads can absorb up to four cups of liquid.   TOP QUALITY & LONG LASTING We use the best available materials to make our dog training pads. These pads will last and last!   VERSATILE, MULTI-PURPOSE PADS Not only for training puppies, these pads can be used in carriers during long trips, in kennels for dogs that have to be confined, and for whelping. They can also be used with other pets and as a solution to childhood bedwetting.",
    19.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/814ubdJMgkL._AC_SL1500_.jpg"
  ],
  [
    "Aqua 7, Pre-Installed 6 × 120mm PWM ARGB Fan, ATX Mid Tower PC Case, Computer case with Panoramic View Tempered Glass Front & Side Panel, Type C Port, Gaming PC Case, Black",
    "Previous page Next page 1 Airflow Design 2 Exquisite Steel Mesh Previous page Next page 1 Powerful Cooling 2 Hurricane Reversed Fan Previous page Next page 1 Multi-Functional Zone 2 270°Wide Angle View Previous page Next page Previous page Next page Okinos Case Aqua 7 ARGB Black Add to Cart Mirage 6 Add to Cart Cypress 7 Add to Cart Aqua 5 ARGB Black Add to Cart Aqua 5 ARGB White Buying Options Customer Reviews 4.5 out of 5 stars 144 4.4 out of 5 stars 21 4.8 out of 5 stars 22 4.7 out of 5 stars 30 4.7 out of 5 stars 30 Price $89.99$89.99 $89.99$89.99 $82.99$82.99 $74.99$74.99 — Item Dimension 436mm x 210mm x 486mm 435mm x 302mm x 390mm 476mm x 210mm x 486mm 436mm x 210mm x 446mm 436mm x 210mm x 446mm Motherboard Support ATX / MATX / ITX ATX / M-ATX / ITX ATX / M-ATX / ITX MATX / ITX MATX / ITX Fan(s) Included 6 x PWM ARGB fans 4 x PWM ARGB fans 4 x PWM fans 3 x PWM ARGB fans 3 x PWM ARGB fans Controller 6 Port ARGB+PWM 4 Port ARGB Only / 4 Port ARGB Only 4 Port ARGB Only Type - C Type - C Type - C Type - C Type - C Type - C Radiator Support Top:up to 360 ; Side:up to 240 Top:up to 360 ; Side:up to 240 Top:up to 360 ; Side:up to 240 Top:up to 360 Top:up to 360 Fan(s) Support (Top & Side) Top:3x120/2x140 ; Side:2x120 Top:3x120/2x140 ; Side:2x120 Top:3x120/2x140 ; Side:2x120 Top:3x120/2x140 ; Side:2x120 Top:3x120/2x140 ; Side:2x120 Fan(s) Support (Bottom) Bottom:3x120 Bottom:3x120/2x140 Bottom:2x120 Bottom:3x120 Bottom:3x120 Fan(s) Support (Rear) Rear:1x120 Rear:1x120/1x140 Rear:1x120 Rear:1x120 Rear:1x120 Max GPU Length 270mm - 410mm 410mm 280mm - 415mm 415mm 415mm Max PSU Length 210mm - 270mm 225mm 240mm 210mm - 270mm 210mm - 270mm Expansion Slots 7 6 7 5 5",
    89.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/81057nnk9aL._AC_SL1500_.jpg"
  ],
  [
    "Casfuy Dog Nail Grinder Upgraded - Professional 2-Speed Electric Rechargeable Pet Nail Trimmer Painless Paws Grooming & Smoothing for Small Medium Large Dogs & Cats (Dark Blue)",
    "Previous page Next page 1 Rechargeable 2 Correct Usage Steps 3 Recommended By Vet Bring the Grooming Salon to Home N10 Dog Nail Grinder Add to Cart N60 Dog Nail Grinder Add to Cart N65 Dog Nail Grinder Add to Cart Dog Paw Trimmer Add to Cart Replacement Grinder Wheel Add to Cart N30 Dog Nail Grinder Add to Cart Customer Reviews 4.4 out of 5 stars 94,895 4.5 out of 5 stars 6,446 4.5 out of 5 stars 3,937 4.5 out of 5 stars 1,283 4.6 out of 5 stars 1,474 4.5 out of 5 stars 17,356 Price $19.97$19.97 $28.49$28.49 $29.99$29.99 $26.99$26.99 $9.99$9.99 $24.99$24.99 Available Speeds 2 6 6 1 N/A 2 RPM Range 7000-8000 7000-12000 7000-12000 5000 N/A 7000-8000 Available Lights 0 2 2 0 N/A 2 Noise Level <50dB <45dB <45dB <50dB N/A <40dB Available Colors 6 6 6 5 N/A 5",
    29.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/614jcZ0hSzL._AC_SL1500_.jpg"
  ],
  [
    "Anker 10-in-1 USB C Docking Station with Dual HDMI and DisplayPort - For Windows Laptops and MacBook Air/Pro 13/16 inch",
    "Anker 563 USB-C Docking Station(10-in-1) Level Up Your Productivity Anker 563 features 10 powerful ports to connect up to 3 monitors and anything else you need for your workstation. The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.     Unlock Triple Display Anker 563 features the latest DisplayLink technology to connect your laptop with up to 3 monitors.   Previous page Next page 1 Media Display 2 Powerful Charging 3 Unrivaled Connectivity 4 Universal Compatibility Model Number: A8395 Media Display Information Note: 2K monitors that do not support 2048×1152 will usually automatically switch to 1920x1080. Note: The HDMI (2K) port and the DisplayPort (2K) do not support the HDCP, and cannot play HDCP content, including some Netflix and YouTube paid content. When using the above ports to play HDCP content, the video may not be played, the screen may turn black, the video resolution may be greatly reduced, and some other problems may occur. Compatibility Information Host Requirements: The host device must support Power Delivery and DisplayPort Alt Mode. Supported Operating Systems: MacOS 10.14 or later, Windows 7/ 8 / 10 / 11 Note: Please update the DisplayLink software to DisplayLink Manager V1.8 via the DisplayLink official website if you experience display issues when using the 2K DisplayPort with macOS 13. If you cannot detect the dock after updating to macOS Ventura, please follow these steps: Privacy & Security > Allow accessories to connect. Comparison Anker 563 Docking Station Add to Cart Anker 568 Docking Station Add to Cart Anker 778 Docking Station Add to Cart Anker 556 USB-C Hub Add to Cart Anker 364 USB C Hub Add to Cart Anker 552 USB-C Hub Add to Cart Customer Reviews 4.0 out of 5 stars 235 3.9 out of 5 stars 94 3.9 out of 5 stars 151 3.9 out of 5 stars 103 4.3 out of 5 stars 179 4.4 out of 5 stars 92 Price $189.99$189.99 $240.99$240.99 $299.99$299.99 $89.99$89.99 $89.99$89.99 $39.99$39.99 Compatible System Windows, Mac OS Windows Windows Windows Windows Windows, Mac OS Number of Ports 10 11 12 8 10 — Connection Technology USB 5Gbps USB4 (40Gbps) Thunderbolt 4 (40Gbps) USB4（40Gbps） USB 5Gbps USB 5Gbps Charging for Laptop Up to 100W Up to 100W Up to 100W Up to 85W pass through Up to 85W pass through Up to 85W pass through HDMI Port 2 1 1 1 2 1 DisplayPort 1 2 2 1 / / USB-C Port 1× USB 5 Gbps, 30W PD 2× USB 10 Gbps, 30W PD 2× USB 10 Gbps, 30W PD 1× USB 10 Gbps 1× USB 5 Gbps 1× USB 5 Gbps USB-A Port 1× USB 5 Gbps 2x USB2.0 2× USB 5 Gbps 2x USB2.0 2× USB 5 Gbps 2x USB2.0 2× USB 10 Gbps 2× USB 5 Gbps 2x USB2.0 1× USB 5 Gbps 2x USB2.0 Power Supply 180W DC adapter 180W DC adapter 180W DC adapter / / /",
    189.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/61Jq2n7SYPL._AC_SL1500_.jpg"
  ],
  [
    "Kastty 6 Pack 18CM Larger More Activated Carbon Replacement F-ilters for 9L Large Dog Water Fountains, Food Grade, Made of Coconut Activated Carbon and PP Cotton, 6 + 6 P ump F ilters",
    "Kastty water feeder is specially designed for pets.   A variety of designs make it more convenient and comfortable for pets to use. Previous page Next page Different water outlet methods can be selected according to the pet. Previous page Next page Previous page Next page Previous page Next page Kastty Pet Drinking Fountain for Dogs, Cats and Many Pets Dog Water Fountain Add to Cart Cat Water Fountain Add to Cart Dog Water Bowl Dispenser Add to Cart Pet Water Fountain Add to Cart Dog Water Dispenser Add to Cart Customer Reviews 4.2 out of 5 stars 1,273 4.1 out of 5 stars 5 3.9 out of 5 stars 1,457 4.3 out of 5 stars 77 3.2 out of 5 stars 187 Price $69.99$69.99 $39.99$39.99 $39.99$39.99 $69.99$69.99 $59.99$59.99 Capacity 9.5L/2.5Gal 3.5L/118oz 7L/2Gal 10.5L/2.8Gal 14L/3.8Gal Multiple filtration systems ✔ ✔ ✔ ✔ ✔ LED light indication ✔ ✔ ✔ ✔ ✔ Ultra-quiet water pump ✔ ✔ ✔ ✔ ✔ Easy to clean and assemble ✔ ✔ ✔ ✔ ✔",
    18.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/816egCV4sQL._AC_SL1500_.jpg"
  ],
  [
    "Huggies Natural Care Sensitive Baby Wipes, Unscented, Hypoallergenic, 99% Purified Water, 12 Flip-Top Packs (768 Wipes Total), Packaging May Vary",
    "Huggies Natural Care Sensitive Baby Wipes are soft, plant-based wipes since 1990* (*70%+ by weight plant-based materials), made with 99% purified water and 1% skin essential ingredients for a gentle clean. Infused with aloe and vitamin E, the unique base sheet locks-in and absorbs the mess to help keep your baby's skin clean. With no harsh ingredients, Huggies Natural Care unscented diaper wipes are hypoallergenic, dermatologist-tested and pH-balanced to help maintain healthy skin for your baby. They're recognized by the National Eczema Association because they're safe for sensitive skin, being fragrance free, alcohol free, paraben free and do not contain phenoxyethanol or MIT. Huggies Natural Care unscented baby wipes are extra soft and gentle, making them ideal for sensitive newborn skin. These disposable baby wipes come in exclusive Winnie-the-Pooh packaging for a delightful touch. Plus, with EZ Pull 1-Handed Dispensing, it's easy to grab wipes without wasting sheets! With the #1 branded wipe**, you can feel confident you are giving baby a safe, gentle clean every time. (*70%+ by weight) (**Based on US Nielsen data ending 9/4/2021)",
    21.99,
    "Baby Products",
    "https://m.media-amazon.com/images/I/81hpcBXQLZL._SL1500_.jpg"
  ],
  [
    "Dallfoll Reptile Heat Lamps, Turtle Lamp UVA/UVB Turtle Aquarium Tank Heating Lamps with Clamp, 360°Rotatable Basking Lamp for Reptiles Lizard Turtle Snake with 2 Heat Bulbs (Heat Lamp 25w/50w Bulb)",
    "Dallfoll, your trusted seller who are committed to providing the best products and services, if you have any query, please search help from us feel free. Reptile Heat Lamp Fixture Specifications: Lamp Power: 25W/50WColor: Black Material: Ceramic (bulb), stainless steel (tube)Voltage: 110Vlamp size: 5 * 5 * 5cmpackage size: 21 * 16 * 10 cmpackage weight: 580g / 1.28lbs 1 x Reptile Heat Lamp Stand 1 x 25W Bulb 1 x 50W Bulb             Easy Clip Design & Dimmable Switch It’s very easy to set up with this clip design and attach to the tank. Switches of this basking Lamp can adjust the brightness and temperature. 2 UVA & UVB Bulbs There are one 25W and one 50W bulbs come with basking lamp, which has UVA/B that simulate sunlight to provide daily UVA & UVB intake for your pet. Wide Compatibility The turtle heat lamp compatible with all kinds of E26/E27 bulbs, such as fluorescent lamps, incandescent lamps, ceramic heaters, bulbs, halogen lamps, LEDs, etc. and 25W,50W,75W bulbs supported. Kindly Note: 1. Turn ON for 2-4 hours per day is fine, do not keep it always ON, which will reduce lamp lifecycle. 2. After turn ON the lamp the temperature is very high, non-touch, to prevent burns. 3. Don't keep the lamp too close to your Reptiles and Amphibians, around 20-30cm. 4. After removing the lamp, please wait a few minutes to cool down before proceeding. Do not let water contact the bulb. 5. Lamp is intended for indoor use and reptile use. Kindly Note: 1. Turn ON for 2-4 hours per day is fine, do not keep it always ON, which will reduce lamp lifecycle. 2. After turn ON the lamp the temperature is very high, non-touch, to prevent burns. 3. Don't keep the lamp too close to your Reptiles and Amphibians, around 20-30cm. 4. After removing the lamp, please wait a few minutes to cool down before proceeding. Do not let water contact the bulb. 5. Lamp is intended for indoor use and reptile use.",
    18.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71ykReImIbL._AC_SL1500_.jpg"
  ],
  [
    "ELEGOO PLA Filament 1.75mm Black 1KG, 3D Printer Filament Dimensional Accuracy +/- 0.02mm, 1kg Cardboard Spool(2.2lbs) 3D Printing Filament Fits for Most FDM 3D Printers",
    "Start Your 3D Printing Journey Now Neptune 4 Pro 3D Printer Add to Cart Neptune 4 3D Printer Add to Cart Filament Storage Kit Add to Cart Matte PLA Filament Add to Cart PLA Plus Filament Add to Cart PETG Filament Add to Cart PETG PRO Filament Add to Cart Diameter/Size 8.8\"x8.85\"x10.43\" build volume 8.8\"x8.85\"x10.43\" build volume 13.4”x 11.8” 1.75mm 1.75mm 1.75mm 1.75mm Recommended Nozzle Temp / / / 190°C-230°C 205°C-230°C 230°C-260°C 230°C-260°C Dimensional Accuracy / / / +/- 0.02 mm +/- 0.02 mm +/- 0.02 mm +/- 0.02 mm Features Max 500mm/s fast printing Max 500mm/s fast printing Must-have for 3d printer owner Beautiful matte finish Higher impact strength Tough and durable Smooth and reliable printing Fit for / / Most 0.5KG/0.75KG/1KG filament Most 1.75mm FDM 3d printers Most 1.75mm FDM 3d printers Most 1.75mm FDM 3d printers Most 1.75mm FDM 3d printers",
    13.99,
    "Industrial & Scientific",
    "https://m.media-amazon.com/images/I/71K1GjdbxzL._SL1500_.jpg"
  ],
  [
    "WAHL Professional Animal Stainless Steel Attachment Guide Comb Detachable Blade Pet Clippers - #1, 1/2 Inch Cut Length (3374-100), Orange",
    "About this item Durable Stainless Steel Comb: This clipper comb cuts to a 1/2 inch length for professional, easy dog, cat, and pet grooming Color-coded and easy to snap-on stainless-steel attachment guide comb offers a #1, 1/2-inch / 13 millimeter cut length with a peach color For best results, use on Wahl's #30 Ultimate or #30 Competition Series Blade, and can also be used with a #15 or #10 sized blade Not recommended to use with Wahl's #40 Ultimate or Competition Series Blade Other attachment guide combs available separately with different cut lengths to complete the set, including: 1/8-inch, 1/4-inch, 3/4-inch, 3/8-inch, 5/8-inch, 7/8-inch, and 1 inch Backed by Wahl's 30 day satisfaction guarantee › See more product details",
    6.95,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71VGHLWtymL._AC_SL1500_.jpg"
  ],
  [
    "Back Seat Extender for Dogs, Dog Car Seat Cover for Back Seat Supports 400lbs, Hard Bottom Backseat Extender for Dogs, Waterproof Dog Hammock for Car, SUV, Truck Black",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.   Previous page FULIDOUER Buyers' Show Next page Previous page Next page 1 HIGH QUALITY FABRIC 2 CONVENIENT FOR USE 3 EASY TO INSTALL 4 MULTIWAYS TO USE   Previous page Next page 1 100% Waterproof 2 Easy to Clean 3 Sturdy Fabric 4 Have A Fun Car Ride!",
    69.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/714nsqQJSgL._AC_SL1500_.jpg"
  ],
  [
    "PULACO 400GPH Submersible Water Pump with 5 ft Tubing, 25W durable fountain water pump for Pond Fountain, Aquariums Fish Tank, Statuary, Hydroponics",
    "PULACO Your Creative Aquarium & Garden Mate ! PULACO provides you with quality Aquarium & garden equipment and services. We are committed to being the best Outdoor gardening, hydroponic, Aquariums store you can trust. PULACO 400GPH Aquarium Pump Your Best Choice for Aquarium Water Pump 1. The operating temperature range:40-95℉. 2. US Standard Plug is included in the package,which is only suitable for the US, Canada and Mexico. 3. If the water pump is stuck by anything like Mud, garbage, sea salt, etc. need to be cleaned with clean water before use. Durable 25W super efficiency motor continually lift water column, Pond pump voltage is 110V-120V/60Hz. Max flow rate: 400 GPH (1500L/H). Max lift height: 6.5ft / 2.0M Long power cord: 6.0ft/1.8M 2 * nozzles: 0.5 inches and 0.65 inches 1 * Tubing (1/2\")     1. As this aquarium pump is submersible, and need to be put into water fully before power on to avoid the aquarium pump burning out. Prohibit no-load running.It would shorten its lifespan and lead tomaking loud noises when running in the air for long time, Whenchanging water, please disconnect power supply. 2. Due to all the pumps need to be professional water testing by our manufacturer before shipment, if the water pump you receivedhas a little water,please don't worry, the little water was left fromprofessional water testing, it is a normal phenomenon. It is new and normal pump. 3. If the water pump is stuck by anything like Mud, garbage, sea salt, etc. need to be cleaned with clean water before use. 4. The inner shaft will be with a bit little little lubricant to ensure the motor is working well, If you are raising sensitive fish or aquaticplants, please use them in other tanks for a short time then move it into fish tanks. If the product suddenly stop working or make noises, which may caused by debris blockage. Please clean it regularly about, or add some olive oil on the rotor. 5.Insufficient power and insufficient frequency would affect the fountain pump’s flow rate. 400GPH refers to the flow rate without using a pump water pipe. If connected with a pump water pipe, the fountain pump maximum flow rate would less than 400GPH.         Specifications Max Flow Rate: 400 GPH (1500L/H) H-Max (Lift Height): 6.6 ft( 2 m) Power: 25 Watt Stainless steel Shaft Stainless steel standard rotor, anti-corrosion, anti-rust, wear resistant, long service life. High quality motor HIgh quality motor, more stable and efficiency, low noise. Tubing (I/D 1/2 inch) Package include one piece of 5 ft free tubing.(I/D 1/2 inch) 50 GPH Water Pump 95 GPH Water Pump 160 GPH Water Pump 160 GPH LED Water Pump 300 GPH DC Pump 660 GPH Water Pump Add to Cart Add to Cart Add to Cart Add to Cart Buying Options Buying Options Customer Reviews 4.2 out of 5 stars 6,098 4.2 out of 5 stars 7,551 4.2 out of 5 stars 3,643 4.1 out of 5 stars 4,206 4.0 out of 5 stars 131 3.4 out of 5 stars 47 Price $8.99$8.99 $9.99$9.99 $13.99$13.99 $15.99$15.99 — — Free tubing 3.3ft (I/D 1/4inch) 3.3ft (I/D 1/4inch) 3.3ft (I/D 1/4inch) 3.3ft (I/D 1/3inch) / 16ft (I/D 2/3inch) Power 3W 5W 10W 10W 18W 40W Maximum flow rate 50 GPH 95 GPH 160 GPH 160 GPH 300 GPH 600 GPH Maximum lift 2.0 ft 3.0 ft 4.0 ft 4.0 ft 20.0 ft 7.5 ft",
    19.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/61AgbKtvz0L._AC_SL1200_.jpg"
  ],
  [
    "Ankink Remanufactured Ink Cartridge Replacement for Canon 275XL 276XL PG275 CL276 275 276 XL (Black Color 2-Combo Pack) use with TS3522 TR4720 TR4700 TR4722 TS3500 TS3520 Printer",
    "Compatible with: Please confirm your printer model first before you purchasing PIXMA TS PIXMA TS3520 PIXMA TS3522 PIXMA TS3500 PIXMA TR PIXMA TR4720 PIXMA TR4722 PIXMA TR4700 Installation guides: Step 1: Remove the protective cover before installing and tear off the plastic tape. Step 2: Insert the ink cartridge into your printer. Note: Do not touch the chip and the nozzle. If you accidentally touch it, wipe it with an eraser or dry lint-free cloth. Tips: 1. Please wear gloves to prevent from getting ink on your hand. 2. Please clean the printing head before printing. 3. These are NON-genuine ink cartridges and only suitable for printers in North America. Tips: Before placing an order, please be sure to confirm your printer model.Please remove the transparent cover and pull off plastic tape before installing these cartridges. (Don't touch the chip)Printer screen pop up ‘Non-Original Cartridge’? Please just click ‘OK’ and they will go ahead.When occur an error message ‘Replace Cartridge’ or 'Low ink' ? Please reinstall them and try, you can try up to 5 times.           With Upgraded Chip Equipped with the latest upgraded chips to ensure high compatibility. Ankink is the professional assistance you can trust. Excellent Performance High quality ink offers crisp text, vivid graphics and provides clear, consistent and colorful printings. High Yield 400 pages per PG-275XL black cartridge 300 pages per CL-276XL color cartridge Product Packing Ankink's ink cartridge packed individually, strictly checked and tested before delivery.   Make an effort with Ankink.",
    49.99,
    "Office Products",
    "https://m.media-amazon.com/images/I/612VDskp4CL._AC_SL1500_.jpg"
  ],
  [
    "Stylus Pen for iPad 2024-2018 with Faster Charge,Tilt Sensor Battery Indicators Pencil for Apple iPad Pro M4 2024,iPad Air M2 2024,iPad 10/9/8/7/6th,iPad Air 5/4/3,iPad Pro 11 & 12.9\",iPad Mini 6/5",
    "Attention tips in use: Don't need to connect with Bluetooth, just double touch the top of stylus to turn on and use it. And please set your iPad as follows: Only work for the 2018 and above model. Not work for iPhone, Android, Microsoft devices, earlier versions of iPad.Please confirm the model number of the above images before purchase. If the stylus or finger cannot write, please set your iPad as follows: Settings--→Apple Pencil--→Turn off the Apple pencil. Or Settings--→ Notes--→Turn off \"The only Draw with Apple Pencil\".Please ensure it has enough power before use.Cannot be used for switching apps.ALL iPad IOS system must be updated to iOS 12.2 or above.",
    9.99,
    "Cell Phones & Accessories",
    "https://m.media-amazon.com/images/I/61JR8OuqaTL._AC_SL1500_.jpg"
  ],
  [
    "G40 Replacement Light Bulbs, 120V 5W Clear Globe Bulb, E12 C7 Candelabra Base, 1.5 Inch Glass Incandescent Bulbs for Indoor Outdoor Patio String Lights, Warm White -25 Pack",
    "G40 Replacement Bulbs for Outdoor String Lights   Please turn off the power before installation and do not touch the bulb when working. G40 120V 5W incandescent bulb they get hot but had no problems. They burned bright as expected just like the old bulbs from the past. Replacement String Light Bulbs       G40 Replacement Bulbs Clear glass bulbs provides a warm white glow, Soft glow create a relaxing atmosphere.G40 5W bulbs fit in C7 or E12 candelabra base sockets, candelabra light bulbs perfer for night lights, chandeliers, sconces, fixtures, candle lamps and outdoor decorative string lights. 120V 5W Bulb The edison outdoor light bulbs are ideal for use in indoor and outdoor string lights,home, patio, garden, balcony, gazebos, Porch Lights, pendant lamps,tents, streets, shop, restaurant, cafe, hotel, decor lighting .G40 replacement light bulbs for indoor and outdoor light strings. Patio Light Bulbs 5 Watt incandescent bulbs with 0.47 inches e12 candelabra screw base fits c7 base sockets. Excellent tungstens light bulb can fit candelabra, home lighting sockets as well as many pendant light fixtures, commercial string lights. but also the best replacement bulbs for G40 outdoor String light in your garden,backyard and patio. G40 Light Bulbs Replacement       Globe Light Bulbs Warm White Made of clear glass, IP44 Water Resistance Ideal for indoor and outdoor string light, Patio Lights, Backyard Lights.This water resistance light bulbs, 5W E12 C7 G40 replacement bulbs, They fit perfectly provide excellent lighting for backyard entertainment. Outdoor String Light Bulbs Replacement Clear globe light bulbs , replacement light bulbs for Indoor outdoor string lights. Be ideal for various G40 string lights, including, wedding decorative and fixtures ornamental.Excellent tungsten bulb, flicker-free and anti-glare light without strobes and radiation, it can keep your eyes away from exhaustion. Clear Globe G40 Bulbs E12 120V 5W G40 tungsten bulb, E12 universal bulb base, convenient to use and install, high brightness.25 pcs light bulb E12 base socket holder bulb for string light party home decoration 120V.Safe Package:Each bulb has been inserted into it's own compartment to prevent cracking.   G40 Replacement Globe Bulbs Easy Installation G40 light bulbs are the perfect combination of modern technology and vintage styling bulbs. Just screw the e12 base bulbs into the empty sockets, then you can enjoy the vintage atmosphere with you friends. More than 1,000 hours long lifespan, endurable and seldom to replace.G40 tungsten bulb which is excellent illumination and cost-saving in bill. Bright commercial edison string light bulbs, glow a warm white, soft glow create a relaxing and romantic atmosphere. Specifications Power: 5 Watt Input Voltage: 120V Bulb Socket: C7/E12 Bulb Material: Clear Glass IP Rating: IP44 Water Resistance Color Temperature：2200K Warm White Item Quantity: 25 pack G40 Replacement Bulbs, Clear Globe G40 Bulbs E12 120V 5W G40 Led Replacement Bulbs, G40 Led Bulbs For Outdoor String Lights C7 LED Replacement Bulbs, Led Night Light Bulb C7 Clear Multicolor Light Bulb Colorful Replacement Bulbs for Outdoor Decoration C7 Clear Orange Light Bulb, Replacement Bulbs for Outdoor String Lights C7 Halloween Purple String Lights Replacement Bulbs, C7 Black Purple Light Bulbs Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.6 out of 5 stars 562 4.6 out of 5 stars 562 4.8 out of 5 stars 8 4.5 out of 5 stars 47 4.5 out of 5 stars 120 4.5 out of 5 stars 120 Price $14.49$14.49 $19.99$19.99 $16.98$16.98 $14.99$14.99 $12.98$12.98 $11.99$11.99 Wattage 5W 0.6W 0.6W 5W 5W 5W Color Temp 2200K Warm White 2700K Warm White 2700K Warm White 2200K Colorful 2200K Orange 2200K Black Purple",
    14.49,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71VKh1Hm5LL._AC_SL1500_.jpg"
  ],
  [
    "Nature's Way Fortify Extra Strength Probiotics for Women + Prebiotic, Digestive and Immune Health Support Supplement*, 30 Capsules",
    "When you need extra strength support for your extra busy lifestyle of family, work, and self-care, try Fortify Women’s 50 Billion Daily Probiotic. It’s a more potent daily probiotic supplement specially formulated for women with researched probiotic strains to support digestive, immune, and vaginal health.* Each serving provides 50 billion live probiotic cultures plus prebiotics, a food source for good bacteria.* Capsules are resistant to stomach acid, delivering live cultures where they’re needed most. Women’s 50 Billion is Non-GMO Project Verified, Certified Gluten-Free, DNA-Authenticated, and contains the doctor-preferred probiotic strain for regularity.* †† Fortify probiotics don’t require refrigeration so you can take them anywhere and everywhere. One capsule, multiple benefits — that’s the Fortify promise. (Compared to Fortify Women’s 30 Billion.) (††Based on an IQVIA ProVoice survey of Primary Care Physicians, HOWARU® B. lactis HN019™ is the Doctor preferred probiotic strain for Regularity as compared to other strains in leading Probiotic brands, 52-week sales MULO, ending 8/13/23; August 2023.*)*This statement has not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.",
    29.99,
    "Health & Household",
    "https://m.media-amazon.com/images/I/811oRsz1BYL._AC_SL1500_.jpg"
  ],
  [
    "DERMAL 16 Combo Pack A Collagen Essence Korean Face Mask - Hydrating & Soothing Facial Mask with Panthenol - Hypoallergenic Self Care Sheet Mask for All Skin Types - Natural Home Spa Treatment Masks",
    "Previous page Next page Previous page Next page 1 Sheet 2 Ingredients 3 Application 4 Hypoallergenic Previous page Next page 1 Good price 2 High quality 3 Hydrating 4 Moisturizing 5 Variety mood Previous page Next page   DERMAL 24 Combo Pack A Add to Cart DERMAL 16 Combo Pack A Add to Cart DERMAL 16 Combo Pack B Add to Cart DERMAL 12 Combo Masks Add to Cart DERMAL 39 Combo Pack A Add to Cart DERMAL 32 Combo A+B Set Add to Cart Customer Reviews 4.6 out of 5 stars 24,844 4.5 out of 5 stars 37,634 4.5 out of 5 stars 37,634 4.6 out of 5 stars 24,844 4.6 out of 5 stars 9,030 4.7 out of 5 stars 1,019 Price $16.99$16.99 $11.99$11.99 $11.99$11.99 $9.99$9.99 $24.99$24.99 $20.99$20.99 Size 24 Count (Pack of 1) 16 Count (Pack of 1) 16 Count (Pack of 1) 12 Count (Pack of 1) 39 Count (Pack of 1) 32 Count (Pack of 1) Form Sheet Sheet Sheet Sheet Sheet Sheet Scent 24 different fragrances 16 different fragrances 16 different fragrances 12 different fragrances 39 different fragrances 32 different fragrances Mild ingredients ✔ ✔ ✔ ✔ ✔ ✔ Skin type All All All All All All",
    16,
    "Beauty & Personal Care",
    "https://m.media-amazon.com/images/I/71g4qMfl8XL._SL1350_.jpg"
  ],
  [
    "Catstages Purr Pillow Kitty Soothing Plush Cat Toy",
    "The Purr Pillow Kitty by Petstages is a must have for any cat that gets separation anxiety or loves to cuddle! This soft, cozy and adorable sloth has a familiar, comforting purr that calms cats when they’re stressed. The purr mechanism is easily activated by squeezing and lasts 2 minutes. When it’s time to wash, simply remove the purr mechanism and place the soft shell into the washing machine. Leave out to dry before replacing the purr mechanism.",
    10.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71mbCUseEuL._AC_SL1500_.jpg"
  ],
  [
    "Lusso Gear Car Seat Protector for Baby Car Seat - Thick Padding, 2 Mesh Storage Pockets, Waterproof, Protects Fabric or Leather Seats, Non-Slip Padded Backing (Black)",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.         Great For Kids Great for parents! The Lusso Gear car seat protector is designed to shield your interior from booster seat marks, imprints, and spills.   Perfect for Pets Enjoy stress-free travel with your four-legged family. Claws, dirt, and hair, are no match for the Lusso Gear car seat protector.   LATCH Compatible Our car seat protector works with LATCH systems so you can drive with confidence knowing your kids are safe and your seats are protected   Easy Installation Simply run your seatbelt through the lower slots and adjust the upper strap around your headrest for a fast, seamless installation.   Previous page Next page Compare these Lusso Gear products Add to Cart Add to Cart Add to Cart Buying Options Add to Cart Customer Reviews 4.7 out of 5 stars 24,511 4.3 out of 5 stars 17,628 4.1 out of 5 stars 298 4.3 out of 5 stars 984 4.5 out of 5 stars 5,088 Price $29.95$29.95 $28.95$28.95 $19.95$19.95 — $35.95$35.95 Material 600D LussoGaurd Fabric 600D LussoGaurd Fabric 600D LussoGaurd Fabric 600D LussoGaurd Fabric 600D LussoGaurd Fabric Storage Pockets 2 6 1 0 0 Waterproof ✔ ✔ ✔ ✔ ✔ Machine Washable ✔ ✘ ✔ ✔ ✔ Folds Flat ✔ ✔ ✔ ✔ ✔ Multiple Colors ✘ ✘ ✔ ✔ ✔ LATCH Compatible ✔ ✘ ✘ ✔ ✔ Multiple Pack Available ✔ ✔ ✔ ✔ ✘ Weight 1.34lbs (21oz) 2.94lbs(47oz) 0.51lbs (8.1oz) 1.34lbs (21oz) 4lbs(64oz)",
    29.95,
    "Baby Products",
    "https://m.media-amazon.com/images/I/910dyAPfHPL._AC_SL1500_.jpg"
  ],
  [
    "iPhone Charger Cord 3Pack 10FT Apple MFi Certified Nylon Braided Fast Charging Lightning Cable Compatible with iPhone 14/13/12/11 Pro/11/XS MAX/XR and More",
    "Superior Durability The sturdy and resistant nylon iphone charger cable can withstand 180 pounds and 15,000 bends Rupture? No! Prepared using the latest technological process, the lightning cable provide strong and stable adaptability Durable Charging Port The rational design enhances the wear resistance of the port and increases the service life longer than others cables",
    27.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/81JKfp8WbWL._AC_SL1500_.jpg"
  ],
  [
    "ASUS 27” 1080P Video Conference Monitor (BE279QSK) - Full HD, IPS, Built-in Adjustable 2MP Webcam, Mic Array, Speakers, Eye Care, Wall Mountable, Frameless, HDMI, DisplayPort, VGA, Height Adjustable",
    "ASUS BE279QSK is a 27-inch Full HD monitor that features an integrated Full HD (2MP) webcam, microphone array and stereo speakers for video conferencing and live-streaming. Enjoy its 4-way ergonomic stand for easy viewing adjustments and IPS panel for wide-angle viewing and for incredibly sharp imagery and stunning video playback.",
    209,
    "Electronics",
    "https://m.media-amazon.com/images/I/71fgSl4ZmHS._AC_SL1500_.jpg"
  ],
  [
    "FIREOR Dog Squeak Toys, No Stuffing Plush Crinkle Water Bottle Dogs Chew Toy for Small Medium Large Breed Chewer Squeaky Tough Durable Puppy Teething Chewing Interactive Keep Them Busy Birthday Gifts",
    "Super Value Pet Toys This stuffless squeaky plush dog toy bundle contains 5 pack cute durable animals: Rabbit, Raccoon, Squirrel, Duck and Owl. The funny and enrichment toys help dogs to exercise more and improve their health. They can do chewing and teething, tug of war games. Quality playing time together will increase their bond with owner. It's the best gift supplies for dog Birthday Christmas Halloween and all holiday         2-in-1 No Stuffing Funny Toys 100% stuffingless squeaky toy, no any hidden dangerous stuffing. It's very safe for your puppy to play, no worry about swallow or choke on. Duck and owl have pocket(NOTE: ONLY DUCK AND OWL HAVE POCKET)and well-hidden velcro at the tail end, you can insert plastic water bottle(500ml max)then it becomes a safe and durable stuffed plush toy. You can use the new toy to play fetching, tossing, training and interactive game with your fur baby, explore more fun together With Squeakers and Crinkle Paper Rabbit, Raccoon and Squirrel have squeakers in both head and tail. Duck and Owl have squeaker in tail and crinkle paper in both wings which will easily attract dog's attention. When you’re away from home, squeaky sound toys will help release pet's anxiety and pressure, clean their teeth, and reduce their destructive behavior. No need to worry about your dog’s alone at home, or pillows, sofas, shoes, etc getting destroyed Tough and Durable Made of non-toxic premium quality plush fabric, added with thicken liner, incredibly safe, soft and durable. Five different sized cute animal plush bulk toys make it suitable for small, medium and large breeds chewers. Intensive fabric and better stitching let these squeeky toys more durable for dogs. With toys dog won’t feel bored or chew furniture up, their excess energy will be released, no stuffed cotton make you no need to clean up bits of fluff from all over the house",
    20.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/81Fqp912KUL._AC_SL1500_.jpg"
  ],
  [
    "Alpine Muffy Kids - Noise Cancelling Headphones for Kids - CE & ANSI Certified - 25dB - Sensory & Concentration Aid - Blue",
    "Every 8th Child has Permanent Hearing Loss The child's hearing is regularly exposed to loud noises, for example, at parties, parades, school events, festivals, fireworks and car races. It is therefore advisable to avoid noise or at least to wear hearing protection. Comfortable & Safe Earmuffs The robust and comfortable earmuff is made of high-quality material. The adjustable headband covered in soft fabric fits any child’s head so they won’t grow out of it. About Alpine Hearing Protection 25 years of experience have allowed Alpine to develop and offer high quality hearing protection for musicians, children, travellers, water sports enthusiasts, clubbers, motorists and people with sleeping issues. Product Highlights Recommended age 5+ SNR value of 25 dB BPA free material Adjustable headband, fits all children Foldable design, easy to take and store Reddot Design Award winner 2021 Available in 5 colors, for boys and girls Easy to clean, free travel bag",
    29.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/61ciscHanVL._AC_SL1500_.jpg"
  ],
  [
    "Pooper Scooper for Large Dogs，Portable Dog Pooper Scooper with Long Handle,Foldable Pet Pooper Scooper with Waste Bag,Easy to Use Perfect for Grass,Dirt,Gravel（Blue）",
    "WIDE APPLICATION       PARK GRAVEL TRAVEL HOW TO INSTALL EASILY ?   HOMAGICO 32''X20'' Dog Snuffle Mat Homagico 2 Pack 35\" x 40\" Washable Pee Pads for Dogs Homagico 72\" x 72\" Washable Pee Pads for Dogs Homagico 24'' Cat Tunnel Bed (Dark Grey) Homagico 24'' Cat Tunnel Bed (Light Grey) Add to Cart Buying Options Buying Options Buying Options Buying Options Customer Reviews 4.4 out of 5 stars 128 4.5 out of 5 stars 288 4.5 out of 5 stars 288 4.3 out of 5 stars 140 4.3 out of 5 stars 140 Price $26.99$26.99 — — — — For Pet ✓ ✓ ✓ ✓ ✓",
    11.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/81d3Fiu9sKL._AC_SL1500_.jpg"
  ],
  [
    "Handheld Vacuum Cleaner Cordless - Mini Car Vacuum Cleaner Rechargeable for Car, Home, Office, Pet Hair Travel Cleaning (Black)",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Previous page Next page 1 HOSE NOZZLE 2 SLIT NOZZLE 3 BRUSH NOZZLE 4 HOSE NOZZLE       UPFOX 2024 Upgrade Mini Vacuum Cleaner   Handheld Car Vacuum -Black   Handheld Car Vacuum -Blue   Charging Adapter Suction Power 8000PA Suction Power 8000PA Suction Power - Power Supply Cordless Power Supply Cordless Power Supply - Colors Black Colors Blue Colors Black Application For Car, Office, Pet, Camping Application For Car, Office, Pet, Home Application For Handheld Vacuum Cleaner Cordless",
    24.99,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/71igUuZnRWS._AC_SL1500_.jpg"
  ],
  [
    "Razer Gigantus v2 Cloth Gaming Mouse Pad (XXL): Thick, High-Density Foam - Non-Slip Base - Classic Black",
    "Textured micro-weave cloth surface mouse pad for speed and control. Optimized across all mouse sensors for pixel-precise accuracy and total tracking responsiveness.",
    29.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/71eAq4eymkL._AC_SL1500_.jpg"
  ],
  [
    "PRETTYGARDEN Women's Summer Midi Bodycon Dresses Casual Crew Neck Side Slit Sleeveless Knit Cut Out Tank Top Dress",
    "PRETTYGARDEN Womens Spring Sleeveless Tank Top Dresses Casual Crew Neck T Shirt DressStylish Features:-This Ribbed Knit Dress Is Super Stretchy, It Hugs Your Body Perfectly, Showing Off Everything You Have.-Midi Length Bodycon Dress Is Suitable For Women Of Any Ages, And The Side Slit Shows Your Long Legs.-The Cut Out On The Waist Is Just Modest, A Special Design To Add A Little Of Playfulness.-You Can Use A Belt To Create A Variety Of Stylish Look, And A Chic Belt Is The Icing On The Cake.PRETTYGARDEN Formal Dresses For Women Evening Party Summer Tight Bodycon Dress-90% Polyester + 10% Spandex-Many Wonderful Options To Choose From!Army Green Dresses For Women Wedding GuestBlack Dress For Women Party Club NightCamel Dresses For Women Date NightRed Homecoming DressesWhite Bridal Shower Dresses For WomenPRETTYGARDEN Womens Knee Length Fitted Dress Sexy Cut Out Tank Dresses For Party-Superior Material With Exquisite Workmanship Bring You A Comfortable Dressing Experience.-Put On This Dress To Any Occasion And You Can Get A Stunning Fashion Look In An Instant.PRETTYGARDEN Dresses For Work Office Women Sleeveless Ribbed Knit Hollow Out DressFashion Style: Solid Color Sundress/ Sleeveless Tank Top/ Midi Knee Length/ Side Slit/ Ribbed Knit/ Cut Out/ Hollow Out/ Bodycon DressOccasions: This Elegant Dress Can Be Worn For Many Different Occasions: Birthday Party, Cocktail, Wedding, Dating, Streetwear, Daily Wear, Hanging Out, Graduation, Homecoming, Bridal ShowerGarment Care: Machine Wash Or Hand Wash In Cold Water/ Do Not Blench/ Hang To DryPRETTYGARDEN Summer Midi Bodycon Dresses For Women Ribbed Knit Side Slit DressPRETTYGARDEN Classy Solid Color Dress For Women Elegant Sexy Midi Pencil Dresses",
    45.99,
    "Clothing",
    "https://m.media-amazon.com/images/I/61qemRNUv5L._AC_SL1500_.jpg"
  ],
  [
    "SONGMICS Velvet Hangers 60 Pack, Non-Slip Clothes Hangers, Suit Hangers with Shoulder Notches, Pants Bar, 360° Swivel Hook, Space-Saving, for Closet, Ink Black UCRF030B01",
    "Straps-Friendly Design The shoulder notches help keep clothes from slipping off and work great for clothes with straps.   No Unsightly Marks Curved to mimic your shoulders, these hangers keep your clothes in perfect condition and avoid bumps.   Built with Strength Constructed with quality materials and strong construction, each coat hanger can hold up to 11 lb, even for heavier coats.   Resilient and Durable Made of premium ABS plastic, these clothes hangers will not easily break or deform, ideal for long-term use. Keep Your Closet Organized Our velvet hangers offer the perfect combination of style and function. Not only do these hangers have a stylish appearance, but they also offer space-saving benefits with their slim design and ability to hold a max load of 11 lb (5 kg). What’s more, shoulder notches securely hold your clothes with straps, preventing them from slipping off the hanger. Whether you're looking to organize your wardrobe or simply want to upgrade your hangers, these stylish velvet hangers are the perfect choice. Specifications: Color: Ink Black Material: Velvet, ABS Plastic, Metal Hook Size of Each Hanger: 16.9\"W x 8.7\"H (43 x 22 cm) Total Weight of 60 Hangers: 9.5 lb (4.3 kg) Max. Static Load Capacity per Hanger: 11 lb (5 kg） Package Contents: 60 x Velvet Hanger SONGMICS Notes: Do not hang wet clothes on the hangers. Do not hang overweight items on the hangers.- Do not use these hangers in a tumble dryer. Explore Your Favorite 999UCRF029B05 Add to Cart 999UCRF039B03 Add to Cart 999UCRF21PK50 Add to Cart 999UCRF021B02 Add to Cart 999UCRF026W03 Add to Cart 999UCRF026B50 Buying Options 999UCRF12B30 Add to Cart Customer Reviews 4.7 out of 5 stars 2,270 4.7 out of 5 stars 90 4.8 out of 5 stars 6,955 4.8 out of 5 stars 6,955 4.8 out of 5 stars 3,014 4.8 out of 5 stars 3,014 4.7 out of 5 stars 10,610 Price $24.99$24.99 $21.99$21.99 $26.99$26.99 $29.99$29.99 $24.69$24.69 — $34.99$34.99 Material Velvet+Metal Velvet+Metal Velvet+Metal Velvet+Metal Velvet+Metal Velvet+Metal Velvet+Metal Color Black Black Light Pink Black White Black Black Size 16.9\"W x 8.7\"H 17\"W x 8.3\"H 17.1”W x 8.9”H 17.1”W x 8.9”H 16.4\"W x 8.5\"H 16.4\"W x 8.5\"H 16.7\"W x 9.3\"H Pieces 50 pack 50 pack 50 pack 50 pack 50 pack 50 pack 30 pack Max. Static load Capacity 11 lb 11 lb 11 lb 11 lb 11 lb 11 lb 5.5 lb More Choices UJJS021A01 Add to Cart UJJS022W01V1 Add to Cart UJJS023A01 Add to Cart UJJS024A01 Add to Cart UJJS025A01 Add to Cart UJJS003A01 Add to Cart UJJS019A01 Add to Cart Customer Reviews 4.3 out of 5 stars 525 4.4 out of 5 stars 67 4.2 out of 5 stars 125 4.4 out of 5 stars 92 4.4 out of 5 stars 92 4.7 out of 5 stars 1,285 4.6 out of 5 stars 477 Price $24.99$24.99 $25.99$25.99 $24.99$24.99 $19.99$19.99 $19.99$19.99 $25.99$25.99 $17.99$17.99 Giftable ✔ ✔ ✔ ✔ ✔ ✔ ✔ Product Name Jewelry Holder Jewelry Organizer Rotating Jewelry Display Jewelry Display Stand Jewelry Stand Jewelry Stand 4-Tier Earring Organizer Stand Color White + Gold White + Gold White + Gold Metallic Gold Metallic Gold White + Gold White + Gold Mirror ✘ ✔ ✘ ✘ ✘ ✘ ✘ Material Metal, MDF, Velvet Metal Frame, MDF Base, Velvet Engineered Wood, Metal Steel, MDF, Velvet Lining Steel, MDF, Velvet Lining Metal Frame Metal Frame Recommended Uses For Product Necklace, Bracelet, Earring Necklace, Bracelet, Earring Necklace, Earring, Rings Necklace, Choker, Bracelet Necklace, Choker, Bracelet Necklace, Earring, Bracelet Necklace, Earring, Bracelet Product Dimensions 4.5\"D x 7.7\"W x 12.1\"H 6.7\"D x 10.6\"W x 11.4\"H 7.9\"D x 7.9\"W x 13.1\"H 5.12\"D x 8.46\"W x 13.27\"H 4.25\"D x 8.03\"W x 12.4\"H 7\"D x 8\"W x 14.1\"H 4.6\"D x 11.5\"W x 13.8\"H",
    32.99,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/81Z6hVLRheL._AC_SL1500_.jpg"
  ],
  [
    "Crucial X9 Pro for Mac 1TB Portable SSD - Up to 1050MB/s Read and Write - Mac Ready, with Mylio Photos+ Offer - USB 3.2 External Solid State Drive - CT1000X9PROMACSSD9B02",
    "Designed for Mac and optimized to work with Apple devices right out of the box, the Crucial X9 Pro for Mac helps you supercharge your creativity. With space to store thousands of photos, files, and videos and the speed to edit and retouch your media quickly, the Crucial X9 Pro for Mac gives you the capacity to tackle even taxing workloads along with durability and style in the studio, in the field, or wherever you roam.",
    107.04,
    "Electronics",
    "https://m.media-amazon.com/images/I/61FMIVbanlL._AC_SL1080_.jpg"
  ],
  [
    "Weiman Products Stainless Steel Wipes 30 Count (Pack of 1)",
    "Stainless steel wipes provide a brilliant, streak-free shine to clean, shine and protect your stainless steel appliances. In addition to cleaning and polishing, its multipurpose formula also protects surfaces by leaving a shiny, protective barrier that resists fingerprints and repels dust and dirt. Premoistened wipes can be applied directly onto stainless steel surfaces for immediate cleanings. Stainless steel wipes are perfect for cleaning refrigerators, dishwashers, ovens, stoves and more.",
    4.68,
    "Health & Household",
    "https://m.media-amazon.com/images/I/61KLf070RML._AC_SL1245_.jpg"
  ],
  [
    "Wreckfest - Nintendo Switch",
    "Wreckfest is jam-packed with upgrade and customization options. Whether you are preparing for your next demolition derby with reinforced bumpers, roll cages, side protectors and much more, or setting your car up for a banger race with engine performance parts like air filters, camshafts, fuel systems, etc., Wreckfest is shaping up to be the best combative motorsport game out there. • Unique Racing Experience – Exhilarating no-rules racing action with defining, once-in-a-lifetime moments that can be achieved only with a true-to-life physics simulation. Witness insane neck-to-neck fighting on high-speed circuits, face total destruction madness on crazy courses with intersections and oncoming traffic, or go for demolition dominance in derby arenas. • Awesome Cars – Our cars are old, banged up, patched together... They ooze style and character! From old American heavy-hitters to agile Europeans and fun Asians, you won’t find anything like this in other games. • Meaningful Customization – Change not only the look of your cars but also upgrade their body armor – Reinforce them with heavy iron that protects you from damage, but also adds weight, which impacts the cars handling. Modify your car to make a robust tank or a fragile but lightning-fast rocket, or anything in between! • Multiplayer – Wreck your friends online and take racing to the limit while chasing for demolition dominance! • Challenge modes – Have hilarious fun with crop harvesters, lawn mowers, school buses, three-wheelers and much more! • Career Mode – Battle for championships, earn experience, unlock new upgrades and cars, and become the all-time Wreckfest champion!",
    39.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/71Isxv7vbCL._SL1500_.jpg"
  ],
  [
    "Catit Treat Ball, Blue",
    "The catit treat ball is a toy and treat dispenser in one. As the cat plays, chases and swats the ball, treats are released for a yummy surprise. When you turn the lid fully closed, it becomes a regular play ball, so your cat can still have hours of entertainment. The catit treat ball is available in either pink or blue, and will make your cat work and play for its treats.",
    7.11,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/61bV0-JwowL._AC_SL1500_.jpg"
  ],
  [
    "MageGee 75% Mechanical Gaming Keyboard with Blue Switch, LED Blue Backlit Keyboard, 87 Keys Compact TKL Wired Computer Keyboard for Windows Laptop PC Gamer - Blue/White",
    "--Double Shot Injection Keycaps --Solid Alloy Metal Pannel --Ergonomic Radian Design --Come with 16 purple keycaps   75% Mechanical Keyboard 60% Mechanical Keyboard Typewriter Mechanical Keyboard Keyboard and Mouse Comob Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.2 out of 5 stars 3,115 4.4 out of 5 stars 8,173 4.3 out of 5 stars 2,168 4.5 out of 5 stars 936 Price $29.99$29.99 $29.99$29.99 $36.99$36.99 $29.99$29.99 Keys 87 68 104 104 Switch Blue Switch Red Switch Blue Switch Membrane Connection USB Wired Type C Wired USB Wired USB Wired Lighting LED Blue Backlit LED Blue Backlit LED White Backlit RGB Anti-ghosting 100% 100% 100% 100% Media Controls ✓ ✓ ✓ ✓",
    29.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/61MUJioLKOL._AC_SL1500_.jpg"
  ],
  [
    "Optimum Nutrition Micronized Creatine Monohydrate Capsules, Keto Friendly, 2500mg, 100 Capsules",
    "Product Description Optimum Nutrition, Inc. (ON) is part of Glanbia, a leading international cheese and nutritional ingredients group. ON owns and operates two premium sports nutrition brands, Optimum Nutrition and American Body Building (A.B.B.). Together, these brands provide active adults around the world with a comprehensive line of powdered, bar, tablet, capsule and ready to drink products. Brand Story By Optimum Nutrition",
    24.95,
    "Health & Household",
    "https://m.media-amazon.com/images/I/71Hrhe7MYsL._AC_SL1500_.jpg"
  ],
  [
    "Pet Qwerks Dinosaur BarkBone - Nylon Dog Bone for Aggressive Chewers - Bacon Flavor - 6.5\"",
    "The Pet Qwerks Dinosaur BarkBone is a tough dog toy designed for aggressive chewers. It's infused with a delicious bacon flavor that will keep your dog entertained for hours. The unique shape of the Dinosaur BarkBone helps your pet scrape plaque and tartar off their teeth, promoting healthy dental hygiene.This durable nylon bone comes in a variety of sizes to suit dogs of all breeds. Whether you have a playful puppy or a large adult dog, there's a Dinosaur BarkBone that's perfect for them.The Pet Qwerks Dinosaur BarkBone is available in a variety of flavors, including bacon and steak, to keep your dog interested. The long-lasting durability of the Dinosaur BarkBone means that you can provide your dog with hours of safe and satisfying chewing enjoyment.In addition to being a great chew toy, the Dinosaur BarkBone can also help to reduce boredom and destructive chewing behaviors in dogs. By providing your dog with a safe and satisfying outlet for their chewing needs, you can help to keep your furniture and belongings safe.",
    13.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71Ei41UWxOL._AC_SL1500_.jpg"
  ],
  [
    "Poo-Pourri Before-You-Go Toilet Spray, Lavender Vanilla, 2 Fl Oz - Lavender, Vanilla and Citrus",
    "Home sweet throne! Poo~Pourri Lavender Vanilla is a comforting blend of lavender, vanilla and citrus natural Essential oils. Behold. . . the magic of a Jester with the power of a king. Poo~pourri freshens bathroom odors before it begins by creating a barrier on the surface of the water—so you can leave the porcelain throne smelling better than you found it. Contains no harsh chemicals, no parabens, no phthalates, no aerosols and no formaldehyde. Anything is possible now. - Contains no harsh chemicals, no parabens, no phthalates, no aerosols and no formaldehyde",
    11.99,
    "Health & Household",
    "https://m.media-amazon.com/images/I/711Z7oys0DL._AC_SL1500_.jpg"
  ],
  [
    "Dog Carrier Sling - Reversible Puppy Carrier Purse with Storage Pocket, Hand-Free Dog Sling Carrier for Carry Small Dogs and Cats, Travel Safety Harness, Dog and Cat Harness(Black)",
    "About this item 【Quality material】:The dog harness is made of soft and breathable cotton material and soft and breathable fabric, which is skin-friendly and comfortable, making the beloved pet feel comfortable. This small pet purse features an advanced reversible design, and flipping it to the side can change the design pattern and keep our pets forever fresh. 【Safety design】:The dog bag has a dual safety device, and the adjustable safety hook can be fixed on the dog's collar or harness to prevent the dog from accidentally falling off. The opening of the puppy sling holder has a safety buckle to prevent the puppy from jumping out mischievously. 【Multi-purpose】:The dog sling has a large opening and can be easily put into the pet, which is very convenient for us to use. A dog sling can take your pet to the mall, the grocery store, the park, as well as daily walks, and it can provide a comfortable and skin-friendly place for your pet to stay happy together. 【Portable pocket】:Puppies have a pocket on their shoulder strap to store essentials such as phones, keys, cards, and wallets. Our reliable transport vehicles are designed with your convenience in mind. 【Product size】:Dog tote bag size :21 x 12 inches (L x W), shoulder strap length 15 inches. Suitable for small pets up to 12 pounds. For example: Bichon Poodle, Habanero, Chihuahua. The dog sling is machine washable, so you can easily clean it every time it gets dirty. › See more product details",
    11.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/61HpVldk4LL._AC_SL1500_.jpg"
  ],
  [
    "Canon Genuine Toner, Cartridge 104 Black (0263B001), 1 Pack, for Canon imageCLASS D420, D480, MF4150d, MF4270dn, MF4350d, MF4370dn, MF4690 Laser Printer and FAXPHONE L120, L90",
    "Product Description Toner cartridge produces high-quality and long-lasting prints for results that are sure to impress. Airshell protection ensures your cartridge is safely protected until it's opened to ensure consistent performance. Easy-to-use design makes replacing depleted cartridges quick and simple for immediate use. Toner cartridge is designed for use with Canon Faxphone L120, L90; imageClass D420, D480, MF4150, MF4270dn, MF4350d, MF4370dn, MF4380dn and MF4690 Copier. Cartridge yields approximately 2,000 pages. Amazon.com Designed for use with the imageCLASS MF4150 and Faxphone L120, the Canon 104 is a black toner replacement cartridge that combines all the necessary parts in one compact piece. This single-cartridge system includes the toner, drum, and development. Enjoy virtually maintenance-free performance, professional results, and 2,000 pages at five percent coverage with this easy-to-install ink system.",
    101.99,
    "Office Products",
    "https://m.media-amazon.com/images/I/61fMTkmbxsL._AC_SL1500_.jpg"
  ],
  [
    "2.5\" Squeaky Dog Balls for Small Medium Dogs, 6 Pack Small Dog Chew Toys with Spike, Puppy Toys for Teeth Cleaning and Training (Green 6 Pack)",
    "Why does your dog like to play with balls? Dogs have always had the hunting instinct in their genes and they enjoy chasing prey. When you throw balls for your pet, it simulates a hunting action. Fetching ball game satisfy the hunting nature of dogs PWEITUOET dog ball is made of natural rubber, safe and non-toxic, ensure your pet safe to play. PWEITUOET dog ball is the perfect combination of ball toy and squeaky toy, with built-in squeak to ensure no choking risk, catch your dog attention.   Your dog enjoys playing with you! Playtime is an important part of your furry friend's healthy life. Playing is good for your dog's physical and mental health and provides a perfect way to bond with both humans and dogs. squeaky dog balls are ideal OUTSIDE dog toys and are a great choice to help dogs exercise. Not only does chasing the ball stimulate your dog's spirit, it also builds their muscles.   PWEITUOET dog balls also feature gum massage, a soft spiky texture that stimulates blood flow and improves dental health, making them excellent teething toys for puppies. The highly vibrant colors make the ball easy for humans to find in the grass or around the house, perfect for your dog to play with during the day or night. Soft, safe and durable, this fun dog toy is perfect for playing around the house, yard, park or pool.   Dogs are an important part of our family, and they look forward to receiving a gift on important days like birthdays and Christmas, and the PWEITUOET dog ball is an excellent choice!",
    12.59,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/816wpNdWbkL._AC_SL1500_.jpg"
  ],
  [
    "CHONCHOW LED Keyboard and Mouse, 104 Keys Rainbow Backlit Keyboard and 7 Color RGB Mouse, White Gaming Keyboard and Mouse Combo for PC Laptop Xbox PS4 Gamers and Work",
    "Interchangeable WASD Keys You can swap WASD keys and ↑↓←→ keys according to your own game habits.Give full play to your best gaming prowess. 4 Adjustable DPI 1200, 1800, 2400, 3600, 4 level adjustable DPI, suitable for different people or different situations. Simply click the DPI button to make quick adjustments. Ergonomic Design Gaming Mouse The shape of the gaming mouse has been ergonomically designed by a senior designer, so that your fingers gently fit the mouse and won’t become tired.       High Quality Tests show that the LED gaming keyboard keys can be pressed more than 10 million times. You can use this glowing gaming keyboard for a long time without worrying about it getting damaged. Waterproof The USB wired keyboard is waterproof and splash-proof, so you don't have to worry about accidentally spilling water on it. Enjoy eating and drinking while using the keyboard. Strong Compatibility The gaming keyboard and mouse combo work for PC, laptop, PS3, PS4, PS5, Xbox, and Mac. USB plug and play, no additional drivers required. Compatible with Windows 2000/2003/XP/Vista/Win7/Win8/Win10/Win11.   Small Rainbow LED Keyboard and Mouse with Mousepad 87 Keys Wireless Gaming Keyboard and Mouse Combo Add to Cart Add to Cart Customer Reviews 4.3 out of 5 stars 3,182 4.3 out of 5 stars 3,182 Price $19.99$19.99 $35.99$35.99 Brand CHONCHOW CHONCHOW Keyboard Type USB Wired 2.4G Wireless Number of Keys 87 87",
    19.99,
    "Video Games",
    "https://m.media-amazon.com/images/I/61PUrOCDZWL._AC_SL1500_.jpg"
  ],
  [
    "PetSafe Easy Walk Deluxe Dog Harness, No Pull Dog Harness – Perfect for Leash & Harness Training – Stops Pets from Pulling and Choking on Walks – Large, Ocean",
    "Dogs are good at pulling, and if youre training a sled dog team, then youre grateful for that natural ability. But since most dog parents usually go on normal walks instead of mushing, we designed the Deluxe Easy Walk Harness to counteract your dogs desire to pull. With this harness, the leash attaches at the front of your dogs chest, unlike standard collars or back-attachment harnesses which compel the pet parent to pull from behind. This means when your dog pulls forward while wearing the Easy Walk Harness, he will feel your weight from one side and will be less tempted to pull. This deluxe version differs from our standard Easy Walk Harness with added neoprene straps for cool comfort and reflector strips for night safety. This harness was created by a veterinary behaviorist and is trusted by a million dog parents and trainers each year. If you accidentally purchase the wrong size, or if your dog mistakes his harness for a chew toy, our Customer Care experts are happy to assist with replacements or resizing. Your pet deserves the best. Trust PetSafe to help keep your pet healthy, safe and happy.",
    17.95,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71U-eTpL57L._AC_SL1500_.jpg"
  ],
  [
    "BN-LINK WiFi Heavy Duty Smart Plug Outlet, No Hub Required with Timer Function, White, Compatible with Alexa and Google Assistant, 2.4 Ghz Network Only (2 Pack)",
    "Previous page APP Control Turn home appliances on or off from anywhere in the world with your smartphone using the BN-LINK app Share Device All family members can share the Settings Group Control It can control your table lamp, coffee machine, and other home appliances Timer Function You can set when to turn appliances on and off Next page 1 APP Control 2 Share Device 3 Group Control 4 Timer Function       Compare with Similar Items BN-LINK Smart Plug Outlet BN-LINK WiFi Outdoor Plug BN-LINK Light Switch BN-LINK Smart Dimmer BN-LINK Wi-Fi Outlet BN-LINK Smart Dimmer Plug Indoor/Outdoor Indoor Indoor and Outdoor Indoor Indoor Indoor Indoor and Outdoor Plug In/In-Wall Plug In Plug In In-Wall In-Wall In-Wall Plug In Compatible with Alexa Work with Google Assistant Package includes 2 pack 1 pack 1 pack 1 pack 1 pack 1 pack",
    15.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/51FpsvJlDAS._AC_SL1500_.jpg"
  ],
  [
    "Horny Goat Weed Extract Complex - Invigorating Blend with Tribulus Saw Palmetto L Arginine and Tongkat Ali Extract and Maca Root for Men and Women for Enhanced Energy and Stamina - 30 Servings",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.   Peak Power Essentials HGW Add to Cart Male Fertility Support Add to Cart DIM Add to Cart Saw Palmetto Add to Cart Male MV gummies Add to Cart Customer Reviews 3.9 out of 5 stars 33,965 4.3 out of 5 stars 1,873 4.4 out of 5 stars 318 4.5 out of 5 stars 10,248 4.6 out of 5 stars 532 Price $13.77$13.77 $44.99$44.99 $19.55$19.55 $12.77$12.77 $15.77$15.77 Special ingredient Horny goat weed Maca Root DIM Saw Palmetto Coq10 Benefits Enhances male performance Boost male reproductive health Powerful inner balance Thicker hair regrowth Superfood male wellness blend Dietary Type Halal Lactose Free Vegan Vegan Non-GMO Suitable for Men Men Men Men Men Product Type Capsules Capsules Capsules Capsules Gummies Pairs perfectly with Male Fertility Support HGW Male Fertility Support Prostate HGW",
    15.55,
    "Health & Household",
    "https://m.media-amazon.com/images/I/61YIMCRfEtL._AC_SL1500_.jpg"
  ],
  [
    "ONE PIX Stainless Steel Litter Box, Small Cat Litter Box with Lid, 17\" L x 13.3\" W x 11.8\" H, Metal Litter Box with High Side, Kitten Litter Box, Non-Sticky, Odorless, Light Grey",
    "ONE PIX Stainless Steel Cat Litter Box   Say Goodbye to Messy Litter Boxes! The ONE PIX Stainless Steel Cat Litter Box is Durable, Easy to Clean, and Stylish. Stainless Steel Cat Litter Box: Built to Last   Invest in a Durable Litter Box Today! Stop Replacing Litter Boxes: Choose Stainless Steel！ Crafted from high-quality stainless steel, this litter box is built to last, resisting rust, scratches, and dents. Say goodbye to replacing litter boxes frequently! No More Sticky Cat Litter Box   Say goodbye to sticky litter messes! Our non-stick surface prevents clumps from clinging, making cleaning a breeze. With ample space to roam, your pet will enjoy using this litter box.   Our Stainless Steel cat litter box, measuring L17”xW13.3”xH11.8”, provides ample room for small cats, kittens, puppies, rabbits, and other small animals to move around comfortably and do their business without feeling cramped. ONE PIX: Privacy & Odor Control   With a sturdy lid, our ONE PIX litter box provides your feline friend a private space while trapping odors, keeping your home smelling fresh. Spill-Proof Litter Box for a Mess-Free Home   Enjoy pristine floors with our spill-proof litter box. The spill-proof construction and broadened pedal prevent litter from spilling or leaking, keeping your home clean and mess-free.   ONE PIX stainless steel litter box is designed to provide a comfortable and hygienic environment for your beloved pets.",
    39.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71LDzYRisAL._AC_SL1500_.jpg"
  ],
  [
    "MSI MPG A1000G PCIE 5 & ATX 3.0 Gaming Power Supply - Full Modular - 80 Plus Gold Certified 1000W - 100% Japanese 105°C Capacitors - Compact Size - ATX PSU",
    "The MPG gaming power supply is proudly backed by a 10-year limited warranty, guaranteeing long term reliable operation. Aiming for unwavering product quality and performance stability, the MPG gaming power supply comes with 100% Japanese 105° C capacitors and solid capacitors. Organizing cables is often the most bothersome part of building a PC. With the MPG gaming power supply’s fully modular design, it means that only the connectors required by the build need to be used, significantly reducing cable clutter and simplifying the system’s overall build.",
    199.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/71FE6h9vTML._AC_SL1500_.jpg"
  ],
  [
    "Drymate Dog Playpen Mat, Absorbent, Waterproof, Non-Slip, Machine Washable, XL Size (60” x 74”), Reusable Puppy Pad for Training, Whelping, Housebreaking, Incontinence, and Crate/Kennel (USA Made)",
    "An Essential Playpen Accessory Protection You Can Count On! Protects floors from spills, stains, and scratches.Absorbs and contains spills and urine, wicks away moisture.Waterproof/Slip-resistant backing prevents liquids from soaking through.Machine washable. Patented Material: U.S. Patent No. 6,419,988 Patented 2-Layer Protection High-quality double-layer protective mat features a soft, paw-friendly top layer that absorbs liquids, wicks away moisture, and features a waterproof/slip-resistant backing to prevent spills and accidents from soaking through to the surface below. This multi-use mat is trimmable, machine washable, and proudly made in the USA from recycled materials.   Features & Benefits   Soft & Comfortable Soft polyester material provides a warm & insulated surface that pets love to lay and play on!   Absorbent & Waterproof Waterproof and slip-resistant backing prevents liquids from soaking through to the surface below and keeps the mat in place.   Protects Surfaces This low-profile mat protects your floors from spills, stains, and scratches, making cleanup easy!   Easy To Clean This mat is vacuum and machine-washer-friendly (see washing instructions below in the \"Please Note\" section). The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Surface Protection You Can Count on! The Ideal Playpen Accessory: The Drymate Dog Playpen Mat Watch this video to see all the product features in action!   Please Note 1) The mat may initially have some wrinkles/creases from being folded and packaged. Over time these will relax out of the material as the product rebounds from being packaged. 2) For best washing results: Hose off or powerwash with a mild detergent, then hang to dry. If machine washing, use a machine without an agitator and wash separately with a mild detergent, then hang to dry (DO NOT BLEACH OR PUT IN DRYER). Additional Pet Products From Drymate Dog Playpen Mat Add to Cart Whelping Mat Add to Cart Dog Crate Mat Add to Cart Original Cat Litter Mat Add to Cart Premium Ridged Litter Mat Add to Cart Jumbo Plush Litter Mat Add to Cart Customer Reviews 4.5 out of 5 stars 1,240 4.5 out of 5 stars 3,451 4.3 out of 5 stars 1,856 4.2 out of 5 stars 3,237 4.0 out of 5 stars 368 4.2 out of 5 stars 1,120 Price $39.99$39.99 $54.99$54.99 $15.99$15.99 $19.99$19.99 $22.99$22.99 $33.99$33.99 Absorbs & Contains Liquids ✔ ✔ ✔ ✔ ✔ ✔ Waterproof Slip-Resist Backing ✔ ✔ ✔ ✔ ✔ ✔ Machine Washable & Reusable ✔ ✔ ✔ ✔ ✔ ✔ Trimmable ✔ ✔ ✔ ✔ ✔ ✔ Material Type Original Material Original Material Original Material Original Material Premium Ridged Material Plush Ridged Material Made in the USA ✔ ✔ ✔ ✔ ✔ ✔ Made from Recycled Materials ✔ ✔ ✔ ✔ ✔ ✔ Additional Home & Pet Products From Drymate Under Sink Mat Add to Cart Shelf & Drawer Liners Add to Cart Dish Drying Mat Add to Cart Reversible Plant Coasters Add to Cart Original Garage Mat Add to Cart Maintenance Mat Add to Cart Customer Reviews 4.7 out of 5 stars 11,671 4.6 out of 5 stars 1,340 4.4 out of 5 stars 8,711 4.7 out of 5 stars 966 4.4 out of 5 stars 4,831 4.4 out of 5 stars 6,379 Price $9.99$9.99 $19.99$19.99 $12.99$12.99 $19.99$19.99 $139.99$139.99 $39.99$39.99 Absorbs & Contains Liquids ✔ ✔ ✔ ✔ ✔ ✔ Waterproof Slip-Resist Backing ✔ ✔ ✔ ✘ ✔ ✔ Machine Washable & Reusable ✔ ✔ ✔ ✔ ✔ ✔ Trimmable ✔ ✔ ✔ ✔ ✔ ✔ Material Type Original Material Original Material Original Material Reversible Material Original Material Original material Made in the USA ✔ ✔ ✔ ✔ ✔ ✔ Made from Recycled Materials ✔ ✔ ✔ ✔ ✔ ✔",
    39.99,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/91AQvVL6kvL._AC_SL1500_.jpg"
  ],
  [
    "OXO Good Grips Salt and Pepper Grinder Set, Stainless Steel",
    "OXO Good Grips Salt & Pepper Grinder Set: In the kitchen or at the dining table, the OXO Good Grips Salt & Pepper Grinder Set is always in season. The Grinders are easily adjustable from fine to coarse grind and rest flat when upside down for easy refilling. Non-corrosive ceramic grinders won’t absorb flavors or odors, and are positioned at the top of the Grinders so as not to leave a mess on the counter or table. The Grinders have a soft, non-slip grip for comfortable grinding. Stainless steel accents and clear bodies give the Grinders kitchen-to-table appeal – great for preparing and serving meals. Sold filled with sea salt and black peppercorns. It’s the Little Things: At OXO, we consistently develop products that address even the tiniest of pet peeves, because we know it’s the little things that make the biggest difference. Our Salt & Pepper Grinder Set grinds from the top, so you can avoid leaving a trail of salt & pepper across your countertop. Features & Benefits:Ceramic Grinders will not absorb flavors or odors, providing the best performance for multi-use grindingTop Grinding mechanism helps ensure countertops are clean and free of salt and pepperWide openings and level tops allow Grinders to rest flat while upside down for easy refilling Large, soft, non-slip base allows for comfortable, easy grinding, perfect for seasoning large batches of foodSmoothly Rotating Tabs help make adjusting Grinder settings from fine to coarse a breezeStainless Steel Accents provide kitchen-to-table appeal Good Tip: Our Grinders are also great for grinding whole spices like cumin, coriander and cloves. When you’re ready to switch ingredients, just grind some coarse salt through the Grinder to clean. OXO is dedicated to providing innovative consumer products that make everyday living easier. How do we do it?We study people – lefties and righties, male and female, young and old – interacting with products and identify ways to make them better. Our “question everything” process and relentless attention to detail uncover the best solutions for slicing, peeling, whisking, baking, stirring, washing, scrubbing, dusting, storing and organizing.",
    54.95,
    "Home & Kitchen",
    "https://m.media-amazon.com/images/I/815Zmgpqp-L._AC_SL1500_.jpg"
  ],
  [
    "2 Pack Reptile Feeding Dish Corner Bowl, Reptile Water Dish Food Bowl, Reptile Feeding Terrarium Bowls for Bearded Dragon Lizard Frog Gecko Tortoise Hermit Crab",
    "Minimize food waste with a food bowl that is the right size and depth for beloved pets. This reptile water rock bowl made of resin, not easily tipped over. Resin rock reptile bowl has smooth surface for easy cleaning, so you can easily wash them with water and brush, or wipe it with a rag, then allow it to air dry, saving you a lot of time and energy. These reptile feeder resin bowl are suitable for small reptile and small animals.       Chameleon Tortoise Lizard       Hermit Crab Snake Frog",
    11.98,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/81Rkb+g4+iL._AC_SL1500_.jpg"
  ],
  [
    "SMARTSTANDARD 6.8FT Barn Door Hardware Kit, Sliding Barn Door Track -Smoothly and Quietly -Easy to Install -Includes Step-by-Step Installation Instruction Fit 40\" Wide Door Panel (J Shape Hanger)",
    "Q: How to ensure the stability and safety of the door? 2 * Door Stoppers: Two door stoppers slide along the rail and tighten down at any point to stop your door exactly where you want, and they’re cushioned by rubber caps for a quiet close. 1 * Floor Guide: A T-shaped floor guide is supplied (with anchors) to prevent the door from swinging out or up against the baseboard. 2 * Anti-jumpers- those little round discs- go on top of the door and won't allow door to be lifted off rail unless they're turned. Q: When do you need a headboard? a. If the studs don't line up with the pre-drilled holes in the rail. b. If there is a doorway trim. And \"door depth'' plus \"trim depth'' is greater than 2'' Q: How much space do I need above the doorway? A: You will need a minimum of 6\" from the top of your door to the ceiling (or crown molding, if any) for this kit to fit correctly. Q: How thick of a door will this kit work with? A: There are solutions for any thickness of door! The bolts included for attaching the hangers to the door support a thickness range of 1 3/8\" to 1 3/4\", but this can be easily navigated by countersinking the bolt head into the back side of the door, or by picking up 4 longer bolts from your local hardware store. The other thing affected by a thicker door is the spacing needed between the door and wall (or baseboard/doorway trim). Plug in your door depth and trim depth below: 2''- door depth - trim depth If your answer is 0 or greater, then you're fine. If your answer was negative, then that number is the extra spacing you need. This extra spacing is accomplished by bolting a header board to the studs, and then the rail to this header board. K-Frame H-Frame K-Frame Glass Frameless K-Frame Add to Cart Add to Cart Add to Cart Buying Options Buying Options Customer Reviews 4.4 out of 5 stars 1,790 4.6 out of 5 stars 26 4.4 out of 5 stars 1,080 4.8 out of 5 stars 10 4.5 out of 5 stars 894 Price $123.50$123.50 $159.99$159.99 $179.99$179.99 — — Brand: SMARTSTANDARD SMARTSTANDARD SMARTSTANDARD SMARTSTANDARD SMARTSTANDARD Suitable Track Length (ft): 6.6FT 6.6FT 6.6FT 6.6FT 8FT Color: Natural White Grey White Natural Material: Natural Wood MDF Natural Wood MDF+Glass Natural Wood Weight (lbs): 47.9 78.2 50.4 78.2 70.9 Size: 36'' x 84'' 36'' x 84'' 36'' x 84'' 36'' x 84'' 48'' x 84'' Door Panel Thickness: 1-3/8\" 1-3/8\" 1-3/8\" 1-3/8\" 1-3/8\"",
    28.99,
    "Tools & Home Improvement",
    "https://m.media-amazon.com/images/I/71j2AKxd-yL._AC_SL1500_.jpg"
  ],
  [
    "Fluker's Deep Thermal Heat Lamp for Reptiles with Carbon Infrared Technology, for All Reptile Tanks, Great for Basking, 100 Watt",
    "Introducing Fluker’s Infrared Deep Thermal Heat Lamp Bulbs, the perfect solution to keep your reptile pets warm and healthy. As ectotherms, or “cold-blooded” animals, reptiles depend on the surrounding environmental temperature to regulate their own body temperatures. If the temperature is not appropriate, your pet may be susceptible to digestive problems or infections. Fluker’s Infrared Deep Thermal Heat Lamp Bulbs feature an advanced carbon fiber filament that emits both Infrared A and Infrared B, providing deep muscle tissue penetration that mimics natural sun’s heat. The infrared medium wave energy is easily absorbed by the reptile, which gently increases the temperature of their skin. The advanced Infrared Deep Thermal Heat Bulb offers 24/7 heat with minimal visible light and zero UV emission, so it won't disturb the sleep of reptiles or pets. The heating speed is fast and stable, and the heat is balanced and lasting, making it the perfect heat lamp for any style of terrarium. The parabolic reflector focuses heatwaves for optimal basking conditions, making it the perfect solution to maintain the humidity in your enclosure and prevent dehydration, as they do not evaporate water as quickly as standard heating lamps. These bulbs are manufactured with precision, resulting in higher quality and long-lasting durability. The carbon fiber filament ensures constant heat emission, while the heavy-duty construction guarantees higher durability and longevity. To ensure proper use, refer to the convenient temperature guide on the packaging. Keep your pets warm and healthy with Fluker’s Infrared Deep Thermal Heat Lamp Bulbs!",
    13.49,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/715gYEq5hZL._AC_SL1500_.jpg"
  ],
  [
    "Portta Component to HDMI Converter, YPbPr RGB + R/L Audio to HDMI Converter v1.3 Support 1080P 2 Channel LPCM for HDTV PS2 PS3 HDVD Player Wii Xbox (Component to HDMI) (Converter Without HDMI Cable)",
    "Portta RGB to HDMI Converter The Component to HDMI converter lets you convert and combine analog component video (YPbPr) with corresponding audio into a single HDMI output. The Component to HDMI converter supports high definition video resolutions of up to 1080p, providing the quality and convenience of HDMI without the expense of having to upgrade output devices for HDMI compatibility. 1.0 Applications: It can be applied to a variety of occasions: For digital entertainment center, HDTV retail and show site, HDTV, STB, DVD and Projector factory, conference room, noise space and security concerns, data center control, information distribution presentation, school and corporate training environments. 2.0 Features *Input: Component video (YPbPr), L/R audio *Output: HDMI *Support full range of Component video resolutions: 480i, 480p, 576i, 576p, 720p, 1080i and l080p *HDMI transmission rate: 5Gbps *Support 165MHz/1.65Gbps per channel (4.95Gbps all channels) bandwidth *Support 8bit per channel (24bit all channels) deep color *Support uncompressed 2 channel audio such as LPCM 3.0 Specifications *Input Signal: Component(YPbPr) Signal *Input Video Signal: 0.5-1.0 volts p-p *Output Signal: HDMI Signal *DTV/HDTV: 480i/576i/480p/576p/720p/1080i/1080p *Video Amplifier Bandwidth:1.65Gbps/165MHz *Vertical Frequency Range: 50/60Hz *Power Supply:5V DC *Converter Unit Cert: FCC,CE, RoHS *AC Power Adapter:US, UK,EU, AUS Standard etc 4.0 Pacakage Content *Portta Ypbpr to HDMI Converter x1 *5V DC Power Supply x1 *User Manual x1 *Warranty Card x1(5 Years Worry-free Warranty)",
    29.99,
    "Electronics",
    "https://m.media-amazon.com/images/I/51nMuws9qSL._AC_SL1500_.jpg"
  ],
  [
    "COSRX Snail Mucin 96% Power Face Serum 3.38 fl oz 100ml, Hydrating Serum for Face, Self Care, Glow Skin under Makeup, Korean Skin Care, Korean Beauty",
    "Previous page Next page 1 Results 2 Benefits 3 Key Ingredients 4 How to Use The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.   See all Snail Mucin products Snail 96 Mucin Essence Add to Cart Snail 92 Cream Add to Cart Snail Dual Essence Buying Options Snail Eye Cream Add to Cart Snail Gel Cleanser Add to Cart Snail Sheet Mask Add to Cart Customer Reviews 4.6 out of 5 stars 73,809 4.5 out of 5 stars 44,887 4.5 out of 5 stars 5,059 4.5 out of 5 stars 4,913 4.6 out of 5 stars 2,756 4.7 out of 5 stars 2,370 Price $19.50$19.50 $18.50$18.50 — $16.99$16.99 $15.00$15.00 $19.99$19.99 Product type Essence Cream Essence Eye Cream Cleanser Face Mask Key benefits Tone skin & reduce dark spots Tone and soothe skin barrier Reduce hyperpigmentation Brighten & tighten eye area Cleanse & retore skin barrier Hydrate & nourish skin When to use After cleansing & toning After applying serum/essence After cleansing & toning After applying serum/essence For cleansing skin After cleansing & toning Tested on sensitive skin ✔ ✔ ✔ ✔ ✔ ✔ Not tested on animals ✔ ✔ ✔ ✔ ✔ ✔   Our Brand Story COSRX believes that cosmetics should give more than just outward beauty. We are devoted to enabling individuals to find solutions according to their personal skin conditions. We strive to help our customers gain self-confidence, and ultimately find their own unique beauty inside.   Featured in COSRX has been featured in multiple prominent magazines and our products have received praise from many trusted editors. As proven by the countless articles that have been released, COSRX will continue to listen to the voices of our customers and strive to improve. How is Snail Mucin obtained? Snail Mucin is obtained through placing snails in a dark and quiet environment for 30 minutes, then transferring them back to their homes. Snail Mucin is then collected and processed for cosmetic use. No snails are harmed in the process. Can this be used on sensitive skin? Based on the Skin Irritation Test (on 34 women for 48 hours), and the Human Repeat Insult Patch Test (on 53 men and women aged from 18-59), the Snail 96 Mucin Essence can be used on sensitive skin. How do I know if this product is authentic?​ To ensure the authenticity of the product, please make sure you are purchasing the product from COSRX Inc. The authenticity of the product cannot be promised when purchased from sellers other than COSRX Inc.",
    25,
    "Beauty & Personal Care",
    "https://m.media-amazon.com/images/I/61p-wtpDraL._SL1500_.jpg"
  ],
  [
    "Cat Pheromones Calming Diffuser: Premium Pheromone Diffuser for Cats - Cat Pheromones Diffuser - Cat Calming Diffuser - Cat Calming Pheromone Diffuser, 2 Pack (Purple)",
    "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.",
    29.97,
    "Pet Supplies",
    "https://m.media-amazon.com/images/I/71gOuRIwhJL._AC_SL1500_.jpg"
  ]
]